[
  {
    "doi": "10.1145/3776680",
    "title": "Parametrised Verification of Intel-x86 Programs.",
    "venue": "popl 2026",
    "citation": "Abdulla, Parosh Aziz, et al. “Parametrised Verification of Intel-X86 Programs.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1094–122. Crossref, https://doi.org/10.1145/3776680."
  },
  {
    "doi": "10.1145/3776712",
    "title": "Parameterized Verification of Quantum Circuits.",
    "venue": "popl 2026",
    "citation": "Abdulla, Parosh Aziz, et al. “Parameterized Verification of Quantum Circuits.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2021–50. Crossref, https://doi.org/10.1145/3776712."
  },
  {
    "doi": "10.1145/3776664",
    "title": "AdapTT: Functoriality for Dependent Type Casts.",
    "venue": "popl 2026",
    "citation": "Adjedj, Arthur, et al. “AdapTT: Functoriality for Dependent Type Casts.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 628–58. Crossref, https://doi.org/10.1145/3776664."
  },
  {
    "doi": "10.1145/3776716",
    "title": "Bounded Treewidth, Multiple Context-Free Grammars, and Downward Closures.",
    "venue": "popl 2026",
    "citation": "Aiswarya, C., et al. “Bounded Treewidth, Multiple Context-Free Grammars, and Downward Closures.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2142–73. Crossref, https://doi.org/10.1145/3776716."
  },
  {
    "doi": "10.1145/3776701",
    "title": "Zoo: A Framework for the Verification of Concurrent OCaml 5 Programs using Separation Logic.",
    "venue": "popl 2026",
    "citation": "Allain, Clément, and Gabriel Scherer. “Zoo: A Framework for the Verification of Concurrent OCaml 5 Programs Using Separation Logic.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1702–29. Crossref, https://doi.org/10.1145/3776701."
  },
  {
    "doi": "10.1145/3776713",
    "title": "A Verified High-Performance Composable Object Library for Remote Direct Memory Access.",
    "venue": "popl 2026",
    "citation": "Ambal, Guillaume, et al. “A Verified High-Performance Composable Object Library for Remote Direct Memory Access.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2051–82. Crossref, https://doi.org/10.1145/3776713."
  },
  {
    "doi": "10.1145/3776730",
    "title": "Cryptis: Cryptographic Reasoning in Separation Logic.",
    "venue": "popl 2026",
    "citation": "Azevedo de Amorim, Arthur, et al. “Cryptis: Cryptographic Reasoning in Separation Logic.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2555–85. Crossref, https://doi.org/10.1145/3776730."
  },
  {
    "doi": "10.1145/3776688",
    "title": "U-Turn: Enhancing Incorrectness Analysis by Reversing Direction.",
    "venue": "popl 2026",
    "citation": "Ascari, Flavio, et al. “U-Turn: Enhancing Incorrectness Analysis by Reversing Direction.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1326–52. Crossref, https://doi.org/10.1145/3776688."
  },
  {
    "doi": "10.1145/3776683",
    "title": "Arbitration-Free Consistency Is Available (and Vice Versa).",
    "venue": "popl 2026",
    "citation": "Attiya, Hagit, et al. “Arbitration-Free Consistency Is Available (and Vice Versa).” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1183–211. Crossref, https://doi.org/10.1145/3776683."
  },
  {
    "doi": "10.1145/3776661",
    "title": "General Decidability Results for Systems with Continuous Counters.",
    "venue": "popl 2026",
    "citation": "Balasubramanian, A. R., et al. “General Decidability Results for Systems with Continuous Counters.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 540–67. Crossref, https://doi.org/10.1145/3776661."
  },
  {
    "doi": "10.1145/3776675",
    "title": "Tropical Mathematics and the Lambda-Calculus II: Tropical Geometry of Probabilistic Programming Languages.",
    "venue": "popl 2026",
    "citation": "Barbarossa, Davide, and Paolo Pistone. “Tropical Mathematics and the Lambda-Calculus II: Tropical Geometry of Probabilistic Programming Languages.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 951–80. Crossref, https://doi.org/10.1145/3776675."
  },
  {
    "doi": "10.1145/3776710",
    "title": "Formal Verification for JavaScript Regular Expressions: A Proven Mechanized Semantics and Its Applications.",
    "venue": "popl 2026",
    "citation": "Barrière, Aurèle, et al. “Formal Verification for JavaScript Regular Expressions: A Proven Mechanized Semantics and Its Applications.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1964–93. Crossref, https://doi.org/10.1145/3776710."
  },
  {
    "doi": "10.1145/3776729",
    "title": "Probabilistic Programming with Vectorized Programmable Inference.",
    "venue": "popl 2026",
    "citation": "Becker, McCoy R., et al. “Probabilistic Programming with Vectorized Programmable Inference.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2523–54. Crossref, https://doi.org/10.1145/3776729."
  },
  {
    "doi": "10.1145/3776693",
    "title": "A Modular Static Cost Analysis for GPU Warp-Level Parallelism.",
    "venue": "popl 2026",
    "citation": "Blike, Gregory, et al. “A Modular Static Cost Analysis for GPU Warp-Level Parallelism.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1471–99. Crossref, https://doi.org/10.1145/3776693."
  },
  {
    "doi": "10.1145/3776707",
    "title": "A Logic for the Imprecision of Abstract Interpretations.",
    "venue": "popl 2026",
    "citation": "Campion, Marco, et al. “A Logic for the Imprecision of Abstract Interpretations.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1876–904. Crossref, https://doi.org/10.1145/3776707."
  },
  {
    "doi": "10.1145/3776692",
    "title": "A Synthetic Reconstruction of Multiparty Session Types.",
    "venue": "popl 2026",
    "citation": "Castro-Perez, David, et al. “A Synthetic Reconstruction of Multiparty Session Types.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1442–70. Crossref, https://doi.org/10.1145/3776692."
  },
  {
    "doi": "10.1145/3776700",
    "title": "Consistent Updates for Scalable Microservices.",
    "venue": "popl 2026",
    "citation": "Chait-Roth, Devora, et al. “Consistent Updates for Scalable Microservices.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1673–701. Crossref, https://doi.org/10.1145/3776700."
  },
  {
    "doi": "10.1145/3776714",
    "title": "A Family of Sims with Diverging Interests.",
    "venue": "popl 2026",
    "citation": "Chappe, Nicolas. “A Family of Sims with Diverging Interests.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2083–111. Crossref, https://doi.org/10.1145/3776714."
  },
  {
    "doi": "10.1145/3776689",
    "title": "The Simple Essence of Boolean-Algebraic Subtyping: Semantic Soundness for Algebraic Union, Intersection, Negation, and Equi-recursive Types.",
    "venue": "popl 2026",
    "citation": "Chau, Chun Yin, and Lionel Parreaux. “The Simple Essence of Boolean-Algebraic Subtyping: Semantic Soundness for Algebraic Union, Intersection, Negation, and Equi-Recursive Types.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1353–82. Crossref, https://doi.org/10.1145/3776689."
  },
  {
    "doi": "10.1145/3776723",
    "title": "Counting and Sampling Traces in Regular Languages.",
    "venue": "popl 2026",
    "citation": "de Colnet, Alexis, et al. “Counting and Sampling Traces in Regular Languages.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2352–79. Crossref, https://doi.org/10.1145/3776723."
  },
  {
    "doi": "10.1145/3776695",
    "title": "A Lazy, Concurrent Convertibility Checker.",
    "venue": "popl 2026",
    "citation": "Courant, Nathanaëlle, and Xavier Leroy. “A Lazy, Concurrent Convertibility Checker.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1530–56. Crossref, https://doi.org/10.1145/3776695."
  },
  {
    "doi": "10.1145/3776660",
    "title": "ChiSA: Static Analysis for Lightweight Chisel Verification.",
    "venue": "popl 2026",
    "citation": "Cui, Jiacai, et al. “ChiSA: Static Analysis for Lightweight Chisel Verification.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 507–39. Crossref, https://doi.org/10.1145/3776660."
  },
  {
    "doi": "10.1145/3776645",
    "title": "Normalisation for First-Class Universe Levels.",
    "venue": "popl 2026",
    "citation": "Danielsson, Nils Anders, et al. “Normalisation for First-Class Universe Levels.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 64–88. Crossref, https://doi.org/10.1145/3776645."
  },
  {
    "doi": "10.1145/3776671",
    "title": "Separating the Wheat from the Chaff: Understanding (In-)Completeness of Proof Mechanisms for Separation Logic with Inductive Definitions.",
    "venue": "popl 2026",
    "citation": "Elad, Neta, et al. “Separating the Wheat from the Chaff: Understanding (In-)Completeness of Proof Mechanisms for Separation Logic with Inductive Definitions.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 833–64. Crossref, https://doi.org/10.1145/3776671."
  },
  {
    "doi": "10.1145/3776691",
    "title": "Verifying Almost-Sure Termination for Randomized Distributed Algorithms.",
    "venue": "popl 2026",
    "citation": "Enea, Constantin, et al. “Verifying Almost-Sure Termination for Randomized Distributed Algorithms.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1412–41. Crossref, https://doi.org/10.1145/3776691."
  },
  {
    "doi": "10.1145/3776647",
    "title": "Hadamard-Pi: Equational Quantum Programming.",
    "venue": "popl 2026",
    "citation": "Fang, Wang, et al. “Hadamard-Pi: Equational Quantum Programming.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 117–43. Crossref, https://doi.org/10.1145/3776647."
  },
  {
    "doi": "10.1145/3776705",
    "title": "DafnyMPI: A Dafny Library for Verifying Message-Passing Concurrent Programs.",
    "venue": "popl 2026",
    "citation": "Fedchin, Aleksandr, et al. “DafnyMPI: A Dafny Library for Verifying Message-Passing Concurrent Programs.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1820–46. Crossref, https://doi.org/10.1145/3776705."
  },
  {
    "doi": "10.1145/3776654",
    "title": "JAX Autodiff from a Linear Logic Perspective.",
    "venue": "popl 2026",
    "citation": "Giusti, Giulia, and Michele Pagani. “JAX Autodiff from a Linear Logic Perspective.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 324–53. Crossref, https://doi.org/10.1145/3776654."
  },
  {
    "doi": "10.1145/3776719",
    "title": "Foundational Multi-Modal Program Verifiers.",
    "venue": "popl 2026",
    "citation": "Gladshtein, Vladimir, et al. “Foundational Multi-Modal Program Verifiers.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2233–64. Crossref, https://doi.org/10.1145/3776719."
  },
  {
    "doi": "10.1145/3776669",
    "title": "Security Reasoning via Substructural Dependency Tracking.",
    "venue": "popl 2026",
    "citation": "Gouni, Hemant, et al. “Security Reasoning via Substructural Dependency Tracking.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 777–805. Crossref, https://doi.org/10.1145/3776669."
  },
  {
    "doi": "10.1145/3776673",
    "title": "Abstraction Functions as Types: Modular Verification of Cost and Behavior in Dependent Type Theory.",
    "venue": "popl 2026",
    "citation": "Grodin, Harrison, et al. “Abstraction Functions as Types: Modular Verification of Cost and Behavior in Dependent Type Theory.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 895–922. Crossref, https://doi.org/10.1145/3776673."
  },
  {
    "doi": "10.1145/3776687",
    "title": "Recurrence Sets for Proving Fair Non-termination under Axiomatic Memory Consistency Models.",
    "venue": "popl 2026",
    "citation": "Haas, Thomas, et al. “Recurrence Sets for Proving Fair Non-Termination under Axiomatic Memory Consistency Models.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1296–325. Crossref, https://doi.org/10.1145/3776687."
  },
  {
    "doi": "10.1145/3776731",
    "title": "Quantum Circuits Are Just a Phase.",
    "venue": "popl 2026",
    "citation": "Heunen, Chris, et al. “Quantum Circuits Are Just a Phase.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2586–613. Crossref, https://doi.org/10.1145/3776731."
  },
  {
    "doi": "10.1145/3776665",
    "title": "Quotient Polymorphism.",
    "venue": "popl 2026",
    "citation": "Hewer, Brandon, and Graham Hutton. “Quotient Polymorphism.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 659–87. Crossref, https://doi.org/10.1145/3776665."
  },
  {
    "doi": "10.1145/3776696",
    "title": "Bayesian Separation Logic: A Logical Foundation and Axiomatic Semantics for Probabilistic Programming.",
    "venue": "popl 2026",
    "citation": "Ho, Shing Hin, et al. “Bayesian Separation Logic: A Logical Foundation and Axiomatic Semantics for Probabilistic Programming.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1557–85. Crossref, https://doi.org/10.1145/3776696."
  },
  {
    "doi": "10.1145/3776721",
    "title": "Welterweight Go: Boxing, Structural Subtyping, and Generics.",
    "venue": "popl 2026",
    "citation": "Hu, Raymond, et al. “Welterweight Go: Boxing, Structural Subtyping, and Generics.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2295–322. Crossref, https://doi.org/10.1145/3776721."
  },
  {
    "doi": "10.1145/3776699",
    "title": "Domain-Theoretic Semantics for Functional Logic Programming.",
    "venue": "popl 2026",
    "citation": "Jones, Eddie, et al. “Domain-Theoretic Semantics for Functional Logic Programming.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1641–72. Crossref, https://doi.org/10.1145/3776699."
  },
  {
    "doi": "10.1145/3776690",
    "title": "Miri: Practical Undefined Behavior Detection for Rust.",
    "venue": "popl 2026",
    "citation": "Jung, Ralf, et al. “Miri: Practical Undefined Behavior Detection for Rust.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1383–411. Crossref, https://doi.org/10.1145/3776690."
  },
  {
    "doi": "10.1145/3776718",
    "title": "Big-Stop Semantics: Small-Step Semantics in a Big-Step Judgment.",
    "venue": "popl 2026",
    "citation": "Kahn, David M., et al. “Big-Stop Semantics: Small-Step Semantics in a Big-Step Judgment.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2204–32. Crossref, https://doi.org/10.1145/3776718."
  },
  {
    "doi": "10.1145/3776706",
    "title": "An Equational Axiomatization of Dynamic Threads via Algebraic Effects: Presheaves on Finite Relations, Labelled Posets, and Parameterized Algebraic Theories.",
    "venue": "popl 2026",
    "citation": "Kammar, Ohad, et al. “An Equational Axiomatization of Dynamic Threads via Algebraic Effects: Presheaves on Finite Relations, Labelled Posets, and Parameterized Algebraic Theories.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1847–75. Crossref, https://doi.org/10.1145/3776706."
  },
  {
    "doi": "10.1145/3776649",
    "title": "Hyperfunctions: Communicating Continuations.",
    "venue": "popl 2026",
    "citation": "Kidney, Donnacha Oisín, and Nicolas Wu. “Hyperfunctions: Communicating Continuations.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 174–203. Crossref, https://doi.org/10.1145/3776649."
  },
  {
    "doi": "10.1145/3771762",
    "title": "Corrigendum: Unrealizability Logic.",
    "venue": "popl 2026",
    "citation": "Kim, Jinwoo, et al. “Corrigendum: Unrealizability Logic.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2672–75. Crossref, https://doi.org/10.1145/3771762."
  },
  {
    "doi": "10.1145/3776733",
    "title": "Coco: Corecursion with Compositional Heterogeneous Productivity.",
    "venue": "popl 2026",
    "citation": "Kim, Jaewoo, et al. “Coco: Corecursion with Compositional Heterogeneous Productivity.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2643–71. Crossref, https://doi.org/10.1145/3776733."
  },
  {
    "doi": "10.1145/3776685",
    "title": "Canonicity for Indexed Inductive-Recursive Types.",
    "venue": "popl 2026",
    "citation": "Kovács, András. “Canonicity for Indexed Inductive-Recursive Types.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1241–69. Crossref, https://doi.org/10.1145/3776685."
  },
  {
    "doi": "10.1145/3776703",
    "title": "Di- is for Directed: First-Order Directed Type Theory via Dinaturality.",
    "venue": "popl 2026",
    "citation": "Laretto, Andrea, et al. “Di- Is for Directed: First-Order Directed Type Theory via Dinaturality.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1759–89. Crossref, https://doi.org/10.1145/3776703."
  },
  {
    "doi": "10.1145/3776694",
    "title": "Inductive Program Synthesis by Meta-Analysis-Guided Hole Filling.",
    "venue": "popl 2026",
    "citation": "Lee, Doyoon, et al. “Inductive Program Synthesis by Meta-Analysis-Guided Hole Filling.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1500–29. Crossref, https://doi.org/10.1145/3776694."
  },
  {
    "doi": "10.1145/3776681",
    "title": "Handling Scope Checks: A Comparative Framework for Dynamic Scope Extrusion Checks.",
    "venue": "popl 2026",
    "citation": "Lee, Michael, et al. “Handling Scope Checks: A Comparative Framework for Dynamic Scope Extrusion Checks.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1123–52. Crossref, https://doi.org/10.1145/3776681."
  },
  {
    "doi": "10.1145/3776704",
    "title": "Encode the Cake and Eat It Too: Controlling Computation in Type Theory, Locally.",
    "venue": "popl 2026",
    "citation": "Leray, Yann, and Théo Winterhalter. “Encode the Cake and Eat It Too: Controlling Computation in Type Theory, Locally.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1790–819. Crossref, https://doi.org/10.1145/3776704."
  },
  {
    "doi": "10.1145/3776727",
    "title": "What Is a Monoid?",
    "venue": "popl 2026",
    "citation": "Levy, Paul Blain, and Morgan Rogers. “What Is a Monoid?” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2468–93. Crossref, https://doi.org/10.1145/3776727."
  },
  {
    "doi": "10.1145/3776724",
    "title": "A Complementary Approach to Incorrectness Typing.",
    "venue": "popl 2026",
    "citation": "Li, Celia Mengyue, et al. “A Complementary Approach to Incorrectness Typing.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2380–408. Crossref, https://doi.org/10.1145/3776724."
  },
  {
    "doi": "10.1145/3776702",
    "title": "The Relative Monadic Metalanguage.",
    "venue": "popl 2026",
    "citation": "Liell-Cock, Jack, et al. “The Relative Monadic Metalanguage.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1730–58. Crossref, https://doi.org/10.1145/3776702."
  },
  {
    "doi": "10.1145/3776663",
    "title": "Optimising Density Computations in Probabilistic Programs via Automatic Loop Vectorisation.",
    "venue": "popl 2026",
    "citation": "Lim, Sangho, et al. “Optimising Density Computations in Probabilistic Programs via Automatic Loop Vectorisation.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 597–627. Crossref, https://doi.org/10.1145/3776663."
  },
  {
    "doi": "10.1145/3776672",
    "title": "Algorithmic Conversion with Surjective Pairing: A Syntactic and Untyped Approach.",
    "venue": "popl 2026",
    "citation": "Liu, Yiyun, and Stephanie Weirich. “Algorithmic Conversion with Surjective Pairing: A Syntactic and Untyped Approach.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 865–94. Crossref, https://doi.org/10.1145/3776672."
  },
  {
    "doi": "10.1145/3776726",
    "title": "Parameterized Infinite-State Reactive Synthesis.",
    "venue": "popl 2026",
    "citation": "Maderbacher, Benedikt, and Roderick Bloem. “Parameterized Infinite-State Reactive Synthesis.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2439–67. Crossref, https://doi.org/10.1145/3776726."
  },
  {
    "doi": "10.1145/3776715",
    "title": "Classical Notions of Computation and the Hasegawa-Thielecke Theorem.",
    "venue": "popl 2026",
    "citation": "Mangel, Éléonore, et al. “Classical Notions of Computation and the Hasegawa-Thielecke Theorem.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2112–41. Crossref, https://doi.org/10.1145/3776715."
  },
  {
    "doi": "10.1145/3776698",
    "title": "Determination Problems for Orbit Closures and Matrix Groups.",
    "venue": "popl 2026",
    "citation": "El Manssour, Rida Ait, et al. “Determination Problems for Orbit Closures and Matrix Groups.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1615–40. Crossref, https://doi.org/10.1145/3776698."
  },
  {
    "doi": "10.1145/3776648",
    "title": "RapunSL: Untangling Quantum Computing with Separation, Linear Combination and Mixing.",
    "venue": "popl 2026",
    "citation": "Matsushita, Yusuke, et al. “RapunSL: Untangling Quantum Computing with Separation, Linear Combination and Mixing.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 144–73. Crossref, https://doi.org/10.1145/3776648."
  },
  {
    "doi": "10.1145/3776711",
    "title": "Lazy Linearity for a Core Functional Language.",
    "venue": "popl 2026",
    "citation": "Mesquita, Rodrigo, and Bernardo Toninho. “Lazy Linearity for a Core Functional Language.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1994–2020. Crossref, https://doi.org/10.1145/3776711."
  },
  {
    "doi": "10.1145/3776717",
    "title": "Oriented Metrics for Bottom-Up Enumerative Synthesis.",
    "venue": "popl 2026",
    "citation": "Meyer, Roland, and Jakob Tepe. “Oriented Metrics for Bottom-Up Enumerative Synthesis.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2174–203. Crossref, https://doi.org/10.1145/3776717."
  },
  {
    "doi": "10.1145/3776655",
    "title": "TypeDis: A Type System for Disentanglement.",
    "venue": "popl 2026",
    "citation": "Moine, Alexandre, et al. “TypeDis: A Type System for Disentanglement.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 354–83. Crossref, https://doi.org/10.1145/3776655."
  },
  {
    "doi": "10.1145/3776668",
    "title": "All for One and One for All: Program Logics for Exploiting Internal Determinism in Parallel Programs.",
    "venue": "popl 2026",
    "citation": "Moine, Alexandre, et al. “All for One and One for All: Program Logics for Exploiting Internal Determinism in Parallel Programs.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 748–76. Crossref, https://doi.org/10.1145/3776668."
  },
  {
    "doi": "10.1145/3776720",
    "title": "Generating Compilers for Qubit Mapping and Routing.",
    "venue": "popl 2026",
    "citation": "Molavi, Abtin, et al. “Generating Compilers for Qubit Mapping and Routing.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2265–94. Crossref, https://doi.org/10.1145/3776720."
  },
  {
    "doi": "10.1145/3776682",
    "title": "Endangered by the Language But Saved by the Compiler: Robust Safety via Semantic Back-Translation.",
    "venue": "popl 2026",
    "citation": "Mück, Niklas, et al. “Endangered by the Language But Saved by the Compiler: Robust Safety via Semantic Back-Translation.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1153–82. Crossref, https://doi.org/10.1145/3776682."
  },
  {
    "doi": "10.1145/3776708",
    "title": "ChopChop: A Programmable Framework for Semantically Constraining the Output of Language Models.",
    "venue": "popl 2026",
    "citation": "Nagy, Shaan, et al. “ChopChop: A Programmable Framework for Semantically Constraining the Output of Language Models.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1905–32. Crossref, https://doi.org/10.1145/3776708."
  },
  {
    "doi": "10.1145/3776725",
    "title": "From Semantics to Syntax: A Type Theory for Comprehension Categories.",
    "venue": "popl 2026",
    "citation": "Najmaei, Niyousha, et al. “From Semantics to Syntax: A Type Theory for Comprehension Categories.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2409–38. Crossref, https://doi.org/10.1145/3776725."
  },
  {
    "doi": "10.1145/3776646",
    "title": "Qudit Quantum Programming with Projective Cliffords.",
    "venue": "popl 2026",
    "citation": "Paykin, Jennifer, and Sam Winnick. “Qudit Quantum Programming with Projective Cliffords.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 89–116. Crossref, https://doi.org/10.1145/3776646."
  },
  {
    "doi": "10.1145/3776722",
    "title": "Nice to Meet You: Synthesizing Practical MLIR Abstract Transformers.",
    "venue": "popl 2026",
    "citation": "Peng, Xuanyu, et al. “Nice to Meet You: Synthesizing Practical MLIR Abstract Transformers.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2323–51. Crossref, https://doi.org/10.1145/3776722."
  },
  {
    "doi": "10.1145/3776650",
    "title": "ArchSem: Reusable Rigorous Semantics of Relaxed Architectures.",
    "venue": "popl 2026",
    "citation": "Pérami, Thibaut, et al. “ArchSem: Reusable Rigorous Semantics of Relaxed Architectures.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 204–34. Crossref, https://doi.org/10.1145/3776650."
  },
  {
    "doi": "10.1145/3776686",
    "title": "Context-Free-Language Reachability for Almost-Commuting Transition Systems.",
    "venue": "popl 2026",
    "citation": "Pimpalkhare, Nikhil, et al. “Context-Free-Language Reachability for Almost-Commuting Transition Systems.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1270–95. Crossref, https://doi.org/10.1145/3776686."
  },
  {
    "doi": "10.1145/3776652",
    "title": "Characterizing Sets of Theories That Can Be Disjointly Combined.",
    "venue": "popl 2026",
    "citation": "Przybocki, Benjamin, et al. “Characterizing Sets of Theories That Can Be Disjointly Combined.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 265–93. Crossref, https://doi.org/10.1145/3776652."
  },
  {
    "doi": "10.1145/3776732",
    "title": "Bounded Sort Polymorphism with Elimination Constraints.",
    "venue": "popl 2026",
    "citation": "Rosain, Johann, et al. “Bounded Sort Polymorphism with Elimination Constraints.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2614–42. Crossref, https://doi.org/10.1145/3776732."
  },
  {
    "doi": "10.1145/3776667",
    "title": "Towards Pen-and-Paper-Style Equational Reasoning in Interactive Theorem Provers by Equality Saturation.",
    "venue": "popl 2026",
    "citation": "Rossel, Marcus, et al. “Towards Pen-and-Paper-Style Equational Reasoning in Interactive Theorem Provers by Equality Saturation.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 718–47. Crossref, https://doi.org/10.1145/3776667."
  },
  {
    "doi": "10.1145/3776657",
    "title": "Typing Strictness.",
    "venue": "popl 2026",
    "citation": "Sainati, Daniel, et al. “Typing Strictness.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 413–43. Crossref, https://doi.org/10.1145/3776657."
  },
  {
    "doi": "10.1145/3776666",
    "title": "On Circuit Description Languages, Indexed Monads, and Resource Analysis.",
    "venue": "popl 2026",
    "citation": "Sakayori, Ken, et al. “On Circuit Description Languages, Indexed Monads, and Resource Analysis.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 688–717. Crossref, https://doi.org/10.1145/3776666."
  },
  {
    "doi": "10.1145/3776670",
    "title": "Dependent Coeffects for Local Sensitivity Analysis.",
    "venue": "popl 2026",
    "citation": "Sannier, Victor, and Patrick Baillot. “Dependent Coeffects for Local Sensitivity Analysis.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 806–32. Crossref, https://doi.org/10.1145/3776670."
  },
  {
    "doi": "10.1145/3776684",
    "title": "The Ghosts of Empires: Extracting Modularity from Interleaving-Based Proofs.",
    "venue": "popl 2026",
    "citation": "Schüssele, Frank, et al. “The Ghosts of Empires: Extracting Modularity from Interleaving-Based Proofs.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1212–40. Crossref, https://doi.org/10.1145/3776684."
  },
  {
    "doi": "10.1145/3776643",
    "title": "The Complexity of Testing Message-Passing Concurrency.",
    "venue": "popl 2026",
    "citation": "Shi, Zheng, et al. “The Complexity of Testing Message-Passing Concurrency.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1–32. Crossref, https://doi.org/10.1145/3776643."
  },
  {
    "doi": "10.1145/3776658",
    "title": "An Expressive Assertion Language for Quantum Programs.",
    "venue": "popl 2026",
    "citation": "Su, Bonan, et al. “An Expressive Assertion Language for Quantum Programs.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 444–75. Crossref, https://doi.org/10.1145/3776658."
  },
  {
    "doi": "10.1145/3776674",
    "title": "Rows and Capabilities as Modal Effects.",
    "venue": "popl 2026",
    "citation": "Tang, Wenhao, and Sam Lindley. “Rows and Capabilities as Modal Effects.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 923–50. Crossref, https://doi.org/10.1145/3776674."
  },
  {
    "doi": "10.1145/3776662",
    "title": "Extensible Data Types with Ad-Hoc Polymorphism.",
    "venue": "popl 2026",
    "citation": "Toohey, Matthew, et al. “Extensible Data Types with Ad-Hoc Polymorphism.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 568–96. Crossref, https://doi.org/10.1145/3776662."
  },
  {
    "doi": "10.1145/3776697",
    "title": "Higher-Order Behavioural Conformances via Fibrations.",
    "venue": "popl 2026",
    "citation": "Urbat, Henning. “Higher-Order Behavioural Conformances via Fibrations.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1586–614. Crossref, https://doi.org/10.1145/3776697."
  },
  {
    "doi": "10.1145/3776677",
    "title": "Compiling to Linear Neurons.",
    "venue": "popl 2026",
    "citation": "Velez-Ginorio, Joey, et al. “Compiling to Linear Neurons.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1010–35. Crossref, https://doi.org/10.1145/3776677."
  },
  {
    "doi": "10.1145/3776676",
    "title": "A Relational Separation Logic for Effect Handlers.",
    "venue": "popl 2026",
    "citation": "de Vilhena, Paulo Emílio, et al. “A Relational Separation Logic for Effect Handlers.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 981–1009. Crossref, https://doi.org/10.1145/3776676."
  },
  {
    "doi": "10.1145/3776728",
    "title": "Stateful Differential Operators for Incremental Computing.",
    "venue": "popl 2026",
    "citation": "Xu, Runqing, and Sebastian Erdweg. “Stateful Differential Operators for Incremental Computing.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 2494–522. Crossref, https://doi.org/10.1145/3776728."
  },
  {
    "doi": "10.1145/3776656",
    "title": "Network Change Validation with Relational NetKAT.",
    "venue": "popl 2026",
    "citation": "Xu, Han, et al. “Network Change Validation with Relational NetKAT.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 384–412. Crossref, https://doi.org/10.1145/3776656."
  },
  {
    "doi": "10.1145/3776653",
    "title": "Local Contextual Type Inference.",
    "venue": "popl 2026",
    "citation": "Xue, Xu, et al. “Local Contextual Type Inference.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 294–323. Crossref, https://doi.org/10.1145/3776653."
  },
  {
    "doi": "10.1145/3776709",
    "title": "Piecewise Analysis of Probabilistic Programs via 𝑘-Induction.",
    "venue": "popl 2026",
    "citation": "Yang, Tengshun, et al. “Piecewise Analysis of Probabilistic Programs via 𝑘-Induction.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1933–63. Crossref, https://doi.org/10.1145/3776709."
  },
  {
    "doi": "10.1145/3776678",
    "title": "Handling Higher-Order Effectful Operations with Judgemental Monadic Laws.",
    "venue": "popl 2026",
    "citation": "Yang, Zhixuan, and Nicolas Wu. “Handling Higher-Order Effectful Operations with Judgemental Monadic Laws.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1036–65. Crossref, https://doi.org/10.1145/3776678."
  },
  {
    "doi": "10.1145/3776679",
    "title": "Accelerating Syntax-Guided Program Synthesis by Optimizing Domain-Specific Languages.",
    "venue": "popl 2026",
    "citation": "Ye, Zhentao, et al. “Accelerating Syntax-Guided Program Synthesis by Optimizing Domain-Specific Languages.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 1066–93. Crossref, https://doi.org/10.1145/3776679."
  },
  {
    "doi": "10.1145/3776659",
    "title": "Fuzzing Guided by Bayesian Program Analysis.",
    "venue": "popl 2026",
    "citation": "Zhang, Yifan, and Xin Zhang. “Fuzzing Guided by Bayesian Program Analysis.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 476–506. Crossref, https://doi.org/10.1145/3776659."
  },
  {
    "doi": "10.1145/3776651",
    "title": "Probabilistic Concurrent Reasoning in Outcome Logic: Independence, Conditioning, and Invariants.",
    "venue": "popl 2026",
    "citation": "Zilberstein, Noam, et al. “Probabilistic Concurrent Reasoning in Outcome Logic: Independence, Conditioning, and Invariants.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 235–64. Crossref, https://doi.org/10.1145/3776651."
  },
  {
    "doi": "10.1145/3776644",
    "title": "Let Generalization, Polymorphic Recursion, and Variable Minimization in Boolean-Kinded Type Systems.",
    "venue": "popl 2026",
    "citation": "Zullo, Joseph A. “Let Generalization, Polymorphic Recursion, and Variable Minimization in Boolean-Kinded Type Systems.” Proceedings of the ACM on Programming Languages, vol. 10, no. POPL, Jan. 2026, pp. 33–63. Crossref, https://doi.org/10.1145/3776644."
  },
  {
    "doi": "10.1145/3674662",
    "title": "Automated Verification of Higher-Order Probabilistic Programs via a Dependent Refinement Type System.",
    "venue": "icfp 2024",
    "citation": "Kura, Satoshi, and Hiroshi Unno. “Automated Verification of Higher-Order Probabilistic Programs via a Dependent Refinement Type System.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 973–1002. Crossref, https://doi.org/10.1145/3674662."
  },
  {
    "doi": "10.1145/3674635",
    "title": "Error Credits: Resourceful Reasoning about Error Bounds for Higher-Order Probabilistic Programs.",
    "venue": "icfp 2024",
    "citation": "Aguirre, Alejandro, et al. “Error Credits: Resourceful Reasoning about Error Bounds for Higher-Order Probabilistic Programs.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 284–316. Crossref, https://doi.org/10.1145/3674635."
  },
  {
    "doi": "10.1145/3674637",
    "title": "Snapshottable Stores.",
    "venue": "icfp 2024",
    "citation": "Allain, Clément, et al. “Snapshottable Stores.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 338–69. Crossref, https://doi.org/10.1145/3674637."
  },
  {
    "doi": "10.1145/3674638",
    "title": "Beyond Trees: Calculating Graph-Based Compilers (Functional Pearl).",
    "venue": "icfp 2024",
    "citation": "Bahr, Patrick, and Graham Hutton. “Beyond Trees: Calculating Graph-Based Compilers (Functional Pearl).” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 370–94. Crossref, https://doi.org/10.1145/3674638."
  },
  {
    "doi": "10.1145/3674627",
    "title": "Compiled, Extensible, Multi-language DSLs (Functional Pearl).",
    "venue": "icfp 2024",
    "citation": "Ballantyne, Michael, et al. “Compiled, Extensible, Multi-Language DSLs (Functional Pearl).” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 64–87. Crossref, https://doi.org/10.1145/3674627."
  },
  {
    "doi": "10.1145/3674652",
    "title": "A Two-Phase Infinite/Finite Low-Level Memory Model: Reconciling Integer-Pointer Casts, Finite Space, and undef at the LLVM IR Level of Abstraction.",
    "venue": "icfp 2024",
    "citation": "Beck, Calvin, et al. “A Two-Phase Infinite/Finite Low-Level Memory Model: Reconciling Integer–Pointer Casts, Finite Space, and Undef at the LLVM IR Level of Abstraction.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 789–817. Crossref, https://doi.org/10.1145/3674652."
  },
  {
    "doi": "10.1145/3674639",
    "title": "Grokking the Sequent Calculus (Functional Pearl).",
    "venue": "icfp 2024",
    "citation": "Binder, David, et al. “Grokking the Sequent Calculus (Functional Pearl).” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 395–425. Crossref, https://doi.org/10.1145/3674639."
  },
  {
    "doi": "10.1145/3674625",
    "title": "How to Bake a Quantum Π.",
    "venue": "icfp 2024",
    "citation": "Carette, Jacques, et al. “How to Bake a Quantum Π.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 1–29. Crossref, https://doi.org/10.1145/3674625."
  },
  {
    "doi": "10.1145/3674657",
    "title": "Synchronous Programming with Refinement Types.",
    "venue": "icfp 2024",
    "citation": "Chen, Jiawei, et al. “Synchronous Programming with Refinement Types.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 938–72. Crossref, https://doi.org/10.1145/3674657."
  },
  {
    "doi": "10.1145/3674634",
    "title": "The Long Way to Deforestation: A Type Inference and Elaboration Technique for Removing Intermediate Data Structures.",
    "venue": "icfp 2024",
    "citation": "Chen, Yijia, and Lionel Parreaux. “The Long Way to Deforestation: A Type Inference and Elaboration Technique for Removing Intermediate Data Structures.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 249–83. Crossref, https://doi.org/10.1145/3674634."
  },
  {
    "doi": "10.1145/3674649",
    "title": "Staged Compilation with Module Functors.",
    "venue": "icfp 2024",
    "citation": "Chiang, Tsung-Ju, et al. “Staged Compilation with Module Functors.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 693–727. Crossref, https://doi.org/10.1145/3674649."
  },
  {
    "doi": "10.1145/3674633",
    "title": "Functional Programming in Financial Markets (Experience Report).",
    "venue": "icfp 2024",
    "citation": "Dijkstra, Atze, et al. “Functional Programming in Financial Markets (Experience Report).” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 234–48. Crossref, https://doi.org/10.1145/3674633."
  },
  {
    "doi": "10.1145/3674654",
    "title": "Call-by-Unboxed-Value.",
    "venue": "icfp 2024",
    "citation": "Downen, Paul. “Call-by-Unboxed-Value.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 845–79. Crossref, https://doi.org/10.1145/3674654."
  },
  {
    "doi": "10.1145/3674628",
    "title": "Double-Ended Bit-Stealing for Algebraic Data Types.",
    "venue": "icfp 2024",
    "citation": "Elsman, Martin. “Double-Ended Bit-Stealing for Algebraic Data Types.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 88–120. Crossref, https://doi.org/10.1145/3674628."
  },
  {
    "doi": "10.1145/3674632",
    "title": "Almost-Sure Termination by Guarded Refinement.",
    "venue": "icfp 2024",
    "citation": "Gregersen, Simon Oddershede, et al. “Almost-Sure Termination by Guarded Refinement.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 203–33. Crossref, https://doi.org/10.1145/3674632."
  },
  {
    "doi": "10.1145/3674640",
    "title": "Sound Borrow-Checking for Rust via Symbolic Semantics.",
    "venue": "icfp 2024",
    "citation": "Ho, Son, et al. “Sound Borrow-Checking for Rust via Symbolic Semantics.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 426–54. Crossref, https://doi.org/10.1145/3674640."
  },
  {
    "doi": "10.1145/3674648",
    "title": "Closure-Free Functional Programming in a Two-Level Type Theory.",
    "venue": "icfp 2024",
    "citation": "Kovács, András. “Closure-Free Functional Programming in a Two-Level Type Theory.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 659–92. Crossref, https://doi.org/10.1145/3674648."
  },
  {
    "doi": "10.1145/3674653",
    "title": "CCLemma: E-Graph Guided Lemma Discovery for Inductive Equational Proofs.",
    "venue": "icfp 2024",
    "citation": "Kurashige, Cole, et al. “CCLemma: E-Graph Guided Lemma Discovery for Inductive Equational Proofs.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 818–44. Crossref, https://doi.org/10.1145/3674653."
  },
  {
    "doi": "10.1145/3674642",
    "title": "Oxidizing OCaml with Modal Memory Management.",
    "venue": "icfp 2024",
    "citation": "Lorenzen, Anton, et al. “Oxidizing OCaml with Modal Memory Management.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 485–514. Crossref, https://doi.org/10.1145/3674642."
  },
  {
    "doi": "10.1145/3674644",
    "title": "Gradual Indexed Inductive Types.",
    "venue": "icfp 2024",
    "citation": "Malewski, Mara, et al. “Gradual Indexed Inductive Types.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 544–72. Crossref, https://doi.org/10.1145/3674644."
  },
  {
    "doi": "10.1145/3674629",
    "title": "A Safe Low-Level Language for Computer Algebra and Its Formally Verified Compiler.",
    "venue": "icfp 2024",
    "citation": "Melquiond, Guillaume, and Josué Moreau. “A Safe Low-Level Language for Computer Algebra and Its Formally Verified Compiler.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 121–46. Crossref, https://doi.org/10.1145/3674629."
  },
  {
    "doi": "10.1145/3674646",
    "title": "Abstract Interpreters: A Monadic Approach to Modular Verification.",
    "venue": "icfp 2024",
    "citation": "Michelland, Sébastien, et al. “Abstract Interpreters: A Monadic Approach to Modular Verification.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 602–29. Crossref, https://doi.org/10.1145/3674646."
  },
  {
    "doi": "10.1145/3674636",
    "title": "Example-Based Reasoning about the Realizability of Polymorphic Programs.",
    "venue": "icfp 2024",
    "citation": "Mulleners, Niek, et al. “Example-Based Reasoning about the Realizability of Polymorphic Programs.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 317–37. Crossref, https://doi.org/10.1145/3674636."
  },
  {
    "doi": "10.1145/3674650",
    "title": "Deriving with Derivatives: Optimizing Incremental Fixpoints for Higher-Order Flow Analysis.",
    "venue": "icfp 2024",
    "citation": "Quiring, Benjamin, and David Van Horn. “Deriving with Derivatives: Optimizing Incremental Fixpoints for Higher-Order Flow Analysis.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 728–55. Crossref, https://doi.org/10.1145/3674650."
  },
  {
    "doi": "10.1145/3674666",
    "title": "A Coq Mechanization of JavaScript Regular Expression Semantics.",
    "venue": "icfp 2024",
    "citation": "De Santo, Noé, et al. “A Coq Mechanization of JavaScript Regular Expression Semantics.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 1003–31. Crossref, https://doi.org/10.1145/3674666."
  },
  {
    "doi": "10.1145/3674631",
    "title": "The Functional, the Imperative, and the Sudoku: Getting Good, Bad, and Ugly to Get Along (Functional Pearl).",
    "venue": "icfp 2024",
    "citation": "Serrano, Manuel, and Robert Bruce Findler. “The Functional, the Imperative, and the Sudoku: Getting Good, Bad, and Ugly to Get Along (Functional Pearl).” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 177–202. Crossref, https://doi.org/10.1145/3674631."
  },
  {
    "doi": "10.1145/3674656",
    "title": "Specification and Verification for Unrestricted Algebraic Effects and Handling.",
    "venue": "icfp 2024",
    "citation": "Song, Yahui, et al. “Specification and Verification for Unrestricted Algebraic Effects and Handling.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 909–37. Crossref, https://doi.org/10.1145/3674656."
  },
  {
    "doi": "10.1145/3674645",
    "title": "Refinement Composition Logic.",
    "venue": "icfp 2024",
    "citation": "Song, Youngju, and Dongjae Lee. “Refinement Composition Logic.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 573–601. Crossref, https://doi.org/10.1145/3674645."
  },
  {
    "doi": "10.1145/3674630",
    "title": "On the Operational Theory of the CPS-Calculus: Towards a Theoretical Foundation for IRs.",
    "venue": "icfp 2024",
    "citation": "Torrens, Paulo, et al. “On the Operational Theory of the CPS-Calculus: Towards a Theoretical Foundation for IRs.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 147–76. Crossref, https://doi.org/10.1145/3674630."
  },
  {
    "doi": "10.1145/3674643",
    "title": "Blame-Correct Support for Receiver Properties in Recursively-Structured Actor Contracts.",
    "venue": "icfp 2024",
    "citation": "Vandenbogaerde, Bram, et al. “Blame-Correct Support for Receiver Properties in Recursively-Structured Actor Contracts.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 515–43. Crossref, https://doi.org/10.1145/3674643."
  },
  {
    "doi": "10.1145/3674647",
    "title": "Dependent Ghosts Have a Reflection for Free.",
    "venue": "icfp 2024",
    "citation": "Winterhalter, Théo. “Dependent Ghosts Have a Reflection for Free.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 630–58. Crossref, https://doi.org/10.1145/3674647."
  },
  {
    "doi": "10.1145/3674626",
    "title": "Story of Your Lazy Function&apos;s Life: A Bidirectional Demand Semantics for Mechanized Cost Analysis of Lazy Programs.",
    "venue": "icfp 2024",
    "citation": "Xia, Li-yao, et al. “Story of Your Lazy Function’s Life: A Bidirectional Demand Semantics for Mechanized Cost Analysis of Lazy Programs.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 30–63. Crossref, https://doi.org/10.1145/3674626."
  },
  {
    "doi": "10.1145/3674651",
    "title": "Parallel Algebraic Effect Handlers.",
    "venue": "icfp 2024",
    "citation": "Xie, Ningning, et al. “Parallel Algebraic Effect Handlers.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 756–88. Crossref, https://doi.org/10.1145/3674651."
  },
  {
    "doi": "10.1145/3674655",
    "title": "Contextual Typing.",
    "venue": "icfp 2024",
    "citation": "Xue, Xu, and Bruno C. d. S. Oliveira. “Contextual Typing.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 880–908. Crossref, https://doi.org/10.1145/3674655."
  },
  {
    "doi": "10.1145/3674641",
    "title": "Abstracting Effect Systems for Algebraic Effect Handlers.",
    "venue": "icfp 2024",
    "citation": "Yoshioka, Takuma, et al. “Abstracting Effect Systems for Algebraic Effect Handlers.” Proceedings of the ACM on Programming Languages, vol. 8, no. ICFP, Aug. 2024, pp. 455–84. Crossref, https://doi.org/10.1145/3674641."
  },
  {
    "doi": "10.1145/3729328",
    "title": "Efficient Linearizability Monitoring.",
    "venue": "pldi 2025",
    "citation": "Abdulla, Parosh Aziz, et al. “Efficient Linearizability Monitoring.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1937–60. Crossref, https://doi.org/10.1145/3729328."
  },
  {
    "doi": "10.1145/3729337",
    "title": "RRR-SMR: Reduce, Reuse, Recycle: Better Methods for Practical Lock-Free Data Structures.",
    "venue": "pldi 2025",
    "citation": "Arovi, Md Amit Hasan, and Ruslan Nikolaev. “RRR-SMR: Reduce, Reuse, Recycle: Better Methods for Practical Lock-Free Data Structures.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 2156–79. Crossref, https://doi.org/10.1145/3729337."
  },
  {
    "doi": "10.1145/3729289",
    "title": "A Hybrid Approach to Semi-automated Rust Verification.",
    "venue": "pldi 2025",
    "citation": "Ayoun, Sacha-Élie, et al. “A Hybrid Approach to Semi-Automated Rust Verification.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 970–92. Crossref, https://doi.org/10.1145/3729289."
  },
  {
    "doi": "10.1145/3729314",
    "title": "Multi-stage Relational Programming.",
    "venue": "pldi 2025",
    "citation": "Ballantyne, Michael, et al. “Multi-Stage Relational Programming.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1591–615. Crossref, https://doi.org/10.1145/3729314."
  },
  {
    "doi": "10.1145/3729292",
    "title": "Lightweight and Locality-Aware Composition of Black-Box Subroutines.",
    "venue": "pldi 2025",
    "citation": "Bansal, Manya, et al. “Lightweight and Locality-Aware Composition of Black-Box Subroutines.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1043–67. Crossref, https://doi.org/10.1145/3729292."
  },
  {
    "doi": "10.1145/3729296",
    "title": "Efficient, Portable, Census-Polymorphic Choreographic Programming.",
    "venue": "pldi 2025",
    "citation": "Bates, Mako, et al. “Efficient, Portable, Census-Polymorphic Choreographic Programming.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1143–66. Crossref, https://doi.org/10.1145/3729296."
  },
  {
    "doi": "10.1145/3729249",
    "title": "RefinedProsa: Connecting Response-Time Analysis with C Verification for Interrupt-Free Schedulers.",
    "venue": "pldi 2025",
    "citation": "Bedarkar, Kimaya, et al. “RefinedProsa: Connecting Response-Time Analysis with C Verification for Interrupt-Free Schedulers.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 73–97. Crossref, https://doi.org/10.1145/3729249."
  },
  {
    "doi": "10.1145/3729265",
    "title": "DR.FIX: Automatically Fixing Data Races at Industry Scale.",
    "venue": "pldi 2025",
    "citation": "Behrang, Farnaz, et al. “DR.FIX: Automatically Fixing Data Races at Industry Scale.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 475–502. Crossref, https://doi.org/10.1145/3729265."
  },
  {
    "doi": "10.1145/3729331",
    "title": "Making Concurrent Hardware Verification Sequential.",
    "venue": "pldi 2025",
    "citation": "Bourgeat, Thomas, et al. “Making Concurrent Hardware Verification Sequential.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 2007–31. Crossref, https://doi.org/10.1145/3729331."
  },
  {
    "doi": "10.1145/3729325",
    "title": "Stochastic Lazy Knowledge Compilation for Inference in Discrete Probabilistic Programs.",
    "venue": "pldi 2025",
    "citation": "Bowers, Maddy, et al. “Stochastic Lazy Knowledge Compilation for Inference in Discrete Probabilistic Programs.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1863–87. Crossref, https://doi.org/10.1145/3729325."
  },
  {
    "doi": "10.1145/3729269",
    "title": "MarQSim: Reconciling Determinism and Randomness in Compiler Optimization for Quantum Simulation.",
    "venue": "pldi 2025",
    "citation": "Cao, Xiuqi, et al. “MarQSim: Reconciling Determinism and Randomness in Compiler Optimization for Quantum Simulation.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 576–600. Crossref, https://doi.org/10.1145/3729269."
  },
  {
    "doi": "10.1145/3729279",
    "title": "Solving Floating-Point Constraints with Continuous Optimization.",
    "venue": "pldi 2025",
    "citation": "Chen, Qian, et al. “Solving Floating-Point Constraints with Continuous Optimization.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 725–47. Crossref, https://doi.org/10.1145/3729279."
  },
  {
    "doi": "10.1145/3729273",
    "title": "A Uniform Framework for Handling Position Constraints in String Solving.",
    "venue": "pldi 2025",
    "citation": "Chen, Yu-Fang, et al. “A Uniform Framework for Handling Position Constraints in String Solving.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 550–75. Crossref, https://doi.org/10.1145/3729273."
  },
  {
    "doi": "10.1145/3729318",
    "title": "Smooth, Integrated Proofs of Cryptographic Constant Time for Nondeterministic Programs and Compilers.",
    "venue": "pldi 2025",
    "citation": "Conoly, Owen, et al. “Smooth, Integrated Proofs of Cryptographic Constant Time for Nondeterministic Programs and Compilers.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1692–715. Crossref, https://doi.org/10.1145/3729318."
  },
  {
    "doi": "10.1145/3729336",
    "title": "A Concurrent Approach to String Transformation Synthesis.",
    "venue": "pldi 2025",
    "citation": "Ding, Yuantian, and Xiaokang Qiu. “A Concurrent Approach to String Transformation Synthesis.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 2131–55. Crossref, https://doi.org/10.1145/3729336."
  },
  {
    "doi": "10.1145/3729311",
    "title": "PulseCore: An Impredicative Concurrent Separation Logic for Dependently Typed Programs.",
    "venue": "pldi 2025",
    "citation": "Ebner, Gabriel, et al. “PulseCore: An Impredicative Concurrent Separation Logic for Dependently Typed Programs.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1516–39. Crossref, https://doi.org/10.1145/3729311."
  },
  {
    "doi": "10.1145/3729261",
    "title": "Certified Compilers à la Carte.",
    "venue": "pldi 2025",
    "citation": "Ebresafe, Oghenevwogaga, et al. “Certified Compilers à La Carte.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 372–95. Crossref, https://doi.org/10.1145/3729261."
  },
  {
    "doi": "10.1145/3729259",
    "title": "Partial Evaluation, Whole-Program Compilation.",
    "venue": "pldi 2025",
    "citation": "Fallin, Chris, and Maxwell Bernstein. “Partial Evaluation, Whole-Program Compilation.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 324–47. Crossref, https://doi.org/10.1145/3729259."
  },
  {
    "doi": "10.1145/3729338",
    "title": "Practical Type Inference with Levels.",
    "venue": "pldi 2025",
    "citation": "Fan, Andong, et al. “Practical Type Inference with Levels.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 2180–203. Crossref, https://doi.org/10.1145/3729338."
  },
  {
    "doi": "10.1145/3729309",
    "title": "First-Class Verification Dialects for MLIR.",
    "venue": "pldi 2025",
    "citation": "Fehr, Mathieu, et al. “First-Class Verification Dialects for MLIR.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1466–90. Crossref, https://doi.org/10.1145/3729309."
  },
  {
    "doi": "10.1145/3729316",
    "title": "Program Synthesis from Partial Traces.",
    "venue": "pldi 2025",
    "citation": "Ferreira, Margarida, et al. “Program Synthesis from Partial Traces.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1642–65. Crossref, https://doi.org/10.1145/3729316."
  },
  {
    "doi": "10.1145/3729317",
    "title": "Probabilistic Refinement Session Types.",
    "venue": "pldi 2025",
    "citation": "Fu, Qiancheng, et al. “Probabilistic Refinement Session Types.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1666–91. Crossref, https://doi.org/10.1145/3729317."
  },
  {
    "doi": "10.1145/3729327",
    "title": "Usability Barriers for Liquid Types.",
    "venue": "pldi 2025",
    "citation": "Gamboa, Catarina, et al. “Usability Barriers for Liquid Types.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1911–36. Crossref, https://doi.org/10.1145/3729327."
  },
  {
    "doi": "10.1145/3729256",
    "title": "Ripple: Asynchronous Programming for Spatial Dataflow Architectures.",
    "venue": "pldi 2025",
    "citation": "Ghosh, Souradip, et al. “Ripple: Asynchronous Programming for Spatial Dataflow Architectures.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 249–76. Crossref, https://doi.org/10.1145/3729256."
  },
  {
    "doi": "10.1145/3729302",
    "title": "An Interactive Debugger for Rust Trait Errors.",
    "venue": "pldi 2025",
    "citation": "Gray, Gavin, et al. “An Interactive Debugger for Rust Trait Errors.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1293–314. Crossref, https://doi.org/10.1145/3729302."
  },
  {
    "doi": "10.1145/3729329",
    "title": "Morello-Cerise: A Proof of Strong Encapsulation for the Arm Morello Capability Hardware Architecture.",
    "venue": "pldi 2025",
    "citation": "Hammond, Angus, et al. “Morello-Cerise: A Proof of Strong Encapsulation for the Arm Morello Capability Hardware Architecture.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1961–83. Crossref, https://doi.org/10.1145/3729329."
  },
  {
    "doi": "10.1145/3729319",
    "title": "Graphiti: Bridging Graph and Relational Database Queries.",
    "venue": "pldi 2025",
    "citation": "He, Yang, et al. “Graphiti: Bridging Graph and Relational Database Queries.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1716–40. Crossref, https://doi.org/10.1145/3729319."
  },
  {
    "doi": "10.1145/3729300",
    "title": "Membership Testing for Semantic Regular Expressions.",
    "venue": "pldi 2025",
    "citation": "Huang, Yifei, et al. “Membership Testing for Semantic Regular Expressions.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1245–68. Crossref, https://doi.org/10.1145/3729300."
  },
  {
    "doi": "10.1145/3729267",
    "title": "Robustifying Debug Information Updates in LLVM via Control-Flow Conformance Analysis.",
    "venue": "pldi 2025",
    "citation": "Huang, Shan, et al. “Robustifying Debug Information Updates in LLVM via Control-Flow Conformance Analysis.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 527–49. Crossref, https://doi.org/10.1145/3729267."
  },
  {
    "doi": "10.1145/3729293",
    "title": "Efficient Formal Verification of Quantum Error Correcting Programs.",
    "venue": "pldi 2025",
    "citation": "Huang, Qifan, et al. “Efficient Formal Verification of Quantum Error Correcting Programs.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1068–93. Crossref, https://doi.org/10.1145/3729293."
  },
  {
    "doi": "10.1145/3729257",
    "title": "StacKAT: Infinite State Network Verification.",
    "venue": "pldi 2025",
    "citation": "Jacobs, Jules, et al. “StacKAT: Infinite State Network Verification.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 277–300. Crossref, https://doi.org/10.1145/3729257."
  },
  {
    "doi": "10.1145/3729246",
    "title": "Verifying General-Purpose RCU for Reclamation in Relaxed Memory Separation Logic.",
    "venue": "pldi 2025",
    "citation": "Jung, Jaehwang, et al. “Verifying General-Purpose RCU for Reclamation in Relaxed Memory Separation Logic.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1–25. Crossref, https://doi.org/10.1145/3729246."
  },
  {
    "doi": "10.1145/3729324",
    "title": "Bean: A Language for Backward Error Analysis.",
    "venue": "pldi 2025",
    "citation": "Kellison, Ariel E., et al. “Bean: A Language for Backward Error Analysis.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1838–62. Crossref, https://doi.org/10.1145/3729324."
  },
  {
    "doi": "10.1145/3729322",
    "title": "Spineless Traversal for Layout Invalidation.",
    "venue": "pldi 2025",
    "citation": "Kirisame, Marisa, et al. “Spineless Traversal for Layout Invalidation.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1791–813. Crossref, https://doi.org/10.1145/3729322."
  },
  {
    "doi": "10.1145/3729310",
    "title": "Robust Constant-Time Cryptography.",
    "venue": "pldi 2025",
    "citation": "Kolosick, Matthew, et al. “Robust Constant-Time Cryptography.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1491–515. Crossref, https://doi.org/10.1145/3729310."
  },
  {
    "doi": "10.1145/3729275",
    "title": "Optimization-Directed Compiler Fuzzing for Continuous Translation Validation.",
    "venue": "pldi 2025",
    "citation": "Kwon, Jaeseong, et al. “Optimization-Directed Compiler Fuzzing for Continuous Translation Validation.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 627–50. Crossref, https://doi.org/10.1145/3729275."
  },
  {
    "doi": "10.1145/3729247",
    "title": "Leveraging Immutability to Validate Hazard Pointers for Optimistic Traversals.",
    "venue": "pldi 2025",
    "citation": "Lee, Janggun, et al. “Leveraging Immutability to Validate Hazard Pointers for Optimistic Traversals.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 26–47. Crossref, https://doi.org/10.1145/3729247."
  },
  {
    "doi": "10.1145/3729308",
    "title": "Principal Type Inference under a Prefix: A Fresh Look at Static Overloading.",
    "venue": "pldi 2025",
    "citation": "Leijen, Daan, and Wenjia Ye. “Principal Type Inference under a Prefix: A Fresh Look at Static Overloading.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1442–65. Crossref, https://doi.org/10.1145/3729308."
  },
  {
    "doi": "10.1145/3729298",
    "title": "Relational Abstractions Based on Labeled Union-Find.",
    "venue": "pldi 2025",
    "citation": "Lesbre, Dorian, et al. “Relational Abstractions Based on Labeled Union-Find.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1194–219. Crossref, https://doi.org/10.1145/3729298."
  },
  {
    "doi": "10.1145/3729255",
    "title": "Support Triangle Machine.",
    "venue": "pldi 2025",
    "citation": "Li, Jiaying, and Chunxue Hao. “Support Triangle Machine.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 225–48. Crossref, https://doi.org/10.1145/3729255."
  },
  {
    "doi": "10.1145/3729330",
    "title": "Guided Tensor Lifting.",
    "venue": "pldi 2025",
    "citation": "Li, Yixuan, et al. “Guided Tensor Lifting.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1984–2006. Crossref, https://doi.org/10.1145/3729330."
  },
  {
    "doi": "10.1145/3729307",
    "title": "Pointer Analysis for Database-Backed Applications.",
    "venue": "pldi 2025",
    "citation": "Liang, Yufei, et al. “Pointer Analysis for Database-Backed Applications.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1417–41. Crossref, https://doi.org/10.1145/3729307."
  },
  {
    "doi": "10.1145/3729266",
    "title": "Link-Time Optimization of Dynamic Casts in C++ Programs.",
    "venue": "pldi 2025",
    "citation": "Lu, Xufan, and Nuno P. Lopes. “Link-Time Optimization of Dynamic Casts in C++ Programs.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 503–26. Crossref, https://doi.org/10.1145/3729266."
  },
  {
    "doi": "10.1145/3729264",
    "title": "Programming by Navigation.",
    "venue": "pldi 2025",
    "citation": "Lubin, Justin, et al. “Programming by Navigation.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 447–74. Crossref, https://doi.org/10.1145/3729264."
  },
  {
    "doi": "10.1145/3729258",
    "title": "Circuit Optimization using Arithmetic Table Lookups.",
    "venue": "pldi 2025",
    "citation": "Malik, Raghav, et al. “Circuit Optimization Using Arithmetic Table Lookups.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 301–23. Crossref, https://doi.org/10.1145/3729258."
  },
  {
    "doi": "10.1145/3729277",
    "title": "Dynamic Robustness Verification against Weak Memory.",
    "venue": "pldi 2025",
    "citation": "Margalit, Roy, et al. “Dynamic Robustness Verification against Weak Memory.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 675–98. Crossref, https://doi.org/10.1145/3729277."
  },
  {
    "doi": "10.1145/3729304",
    "title": "Automated Exploit Generation for Node.js Packages.",
    "venue": "pldi 2025",
    "citation": "Marques, Filipe, et al. “Automated Exploit Generation for Node.Js Packages.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1341–66. Crossref, https://doi.org/10.1145/3729304."
  },
  {
    "doi": "10.1145/3729250",
    "title": "Nola: Later-Free Ghost State for Verifying Termination in Iris.",
    "venue": "pldi 2025",
    "citation": "Matsushita, Yusuke, and Takeshi Tsukada. “Nola: Later-Free Ghost State for Verifying Termination in Iris.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 98–124. Crossref, https://doi.org/10.1145/3729250."
  },
  {
    "doi": "10.1145/3729294",
    "title": "Verified Foundations for Differential Privacy.",
    "venue": "pldi 2025",
    "citation": "de Medeiros, Markus, et al. “Verified Foundations for Differential Privacy.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1094–118. Crossref, https://doi.org/10.1145/3729294."
  },
  {
    "doi": "10.1145/3729263",
    "title": "Semantics of Integrating and Differentiating Singularities.",
    "venue": "pldi 2025",
    "citation": "Michel, Jesse, et al. “Semantics of Integrating and Differentiating Singularities.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 421–46. Crossref, https://doi.org/10.1145/3729263."
  },
  {
    "doi": "10.1145/3729295",
    "title": "Active Learning of Symbolic NetKAT Automata.",
    "venue": "pldi 2025",
    "citation": "Moeller, Mark, et al. “Active Learning of Symbolic NetKAT Automata.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1119–42. Crossref, https://doi.org/10.1145/3729295."
  },
  {
    "doi": "10.1145/3742465",
    "title": "AWDIT: An Optimal Weak Database Isolation Tester.",
    "venue": "pldi 2025",
    "citation": "Møldrup, Lasse, and Andreas Pavlogiannis. “AWDIT: An Optimal Weak Database Isolation Tester.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1540–64. Crossref, https://doi.org/10.1145/3742465."
  },
  {
    "doi": "10.1145/3729334",
    "title": "Roulette: A Language for Expressive, Exact, and Efficient Discrete Probabilistic Programming.",
    "venue": "pldi 2025",
    "citation": "Moy, Cameron, et al. “Roulette: A Language for Expressive, Exact, and Efficient Discrete Probabilistic Programming.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 2081–105. Crossref, https://doi.org/10.1145/3729334."
  },
  {
    "doi": "10.1145/3729274",
    "title": "Type-Constrained Code Generation with Language Models.",
    "venue": "pldi 2025",
    "citation": "Mündler, Niels, et al. “Type-Constrained Code Generation with Language Models.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 601–26. Crossref, https://doi.org/10.1145/3729274."
  },
  {
    "doi": "10.1145/3729320",
    "title": "Verifying Solutions to Semantics-Guided Synthesis Problems.",
    "venue": "pldi 2025",
    "citation": "Murphy, Charlie, et al. “Verifying Solutions to Semantics-Guided Synthesis Problems.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1741–65. Crossref, https://doi.org/10.1145/3729320."
  },
  {
    "doi": "10.1145/3729301",
    "title": "MISAAL: Synthesis-Based Automatic Generation of Efficient and Retargetable Semantics-Driven Optimizations.",
    "venue": "pldi 2025",
    "citation": "Noor, Abdul Rafae, et al. “MISAAL: Synthesis-Based Automatic Generation of Efficient and Retargetable Semantics-Driven Optimizations.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1269–92. Crossref, https://doi.org/10.1145/3729301."
  },
  {
    "doi": "10.1145/3729333",
    "title": "Thrust: A Prophecy-Based Refinement Type System for Rust.",
    "venue": "pldi 2025",
    "citation": "Ogawa, Hiromi, et al. “Thrust: A Prophecy-Based Refinement Type System for Rust.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 2056–80. Crossref, https://doi.org/10.1145/3729333."
  },
  {
    "doi": "10.1145/3729286",
    "title": "Probabilistic Kleene Algebra with Angelic Nondeterminism.",
    "venue": "pldi 2025",
    "citation": "Ong, Shawn, et al. “Probabilistic Kleene Algebra with Angelic Nondeterminism.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 897–919. Crossref, https://doi.org/10.1145/3729286."
  },
  {
    "doi": "10.1145/3729248",
    "title": "Verifying Lock-Free Traversals in Relaxed Memory Separation Logic.",
    "venue": "pldi 2025",
    "citation": "Park, Sunho, et al. “Verifying Lock-Free Traversals in Relaxed Memory Separation Logic.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 48–72. Crossref, https://doi.org/10.1145/3729248."
  },
  {
    "doi": "10.1145/3729332",
    "title": "Correctly Rounded Math Libraries without Worrying about the Application&apos;s Rounding Mode.",
    "venue": "pldi 2025",
    "citation": "Park, Sehyeok, et al. “Correctly Rounded Math Libraries without Worrying about the Application’s Rounding Mode.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 2032–55. Crossref, https://doi.org/10.1145/3729332."
  },
  {
    "doi": "10.1145/3729321",
    "title": "Handling the Selection Monad.",
    "venue": "pldi 2025",
    "citation": "Plotkin, Gordon, and Ningning Xie. “Handling the Selection Monad.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1766–90. Crossref, https://doi.org/10.1145/3729321."
  },
  {
    "doi": "10.1145/3729288",
    "title": "CRGC: Fault-Recovering Actor Garbage Collection in Pekko.",
    "venue": "pldi 2025",
    "citation": "Plyukhin, Dan, et al. “CRGC: Fault-Recovering Actor Garbage Collection in Pekko.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 945–69. Crossref, https://doi.org/10.1145/3729288."
  },
  {
    "doi": "10.1145/3729260",
    "title": "Exploiting Undefined Behavior in C/C++ Programs for Optimization: A Study on the Performance Impact.",
    "venue": "pldi 2025",
    "citation": "Popescu, Lucian, and Nuno P. Lopes. “Exploiting Undefined Behavior in C/C++ Programs for Optimization: A Study on the Performance Impact.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 348–71. Crossref, https://doi.org/10.1145/3729260."
  },
  {
    "doi": "10.1145/3729285",
    "title": "Iso: Request-Private Garbage Collection.",
    "venue": "pldi 2025",
    "citation": "Qiu, Tianle, and Stephen M. Blackburn. “Iso: Request-Private Garbage Collection.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 874–96. Crossref, https://doi.org/10.1145/3729285."
  },
  {
    "doi": "10.1145/3729306",
    "title": "LiDO-DAG: A Framework for Verifying Safety and Liveness of DAG-Based Consensus Protocols.",
    "venue": "pldi 2025",
    "citation": "Qiu, Longfei, et al. “LiDO-DAG: A Framework for Verifying Safety and Liveness of DAG-Based Consensus Protocols.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1392–416. Crossref, https://doi.org/10.1145/3729306."
  },
  {
    "doi": "10.1145/3729280",
    "title": "Webs and Flow-Directed Well-Typedness Preserving Program Transformations.",
    "venue": "pldi 2025",
    "citation": "Quiring, Benjamin, et al. “Webs and Flow-Directed Well-Typedness Preserving Program Transformations.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 748–72. Crossref, https://doi.org/10.1145/3729280."
  },
  {
    "doi": "10.1145/3729323",
    "title": "Exact Loop Bound Analysis.",
    "venue": "pldi 2025",
    "citation": "Riley, Daniel, and Grigory Fedyukovich. “Exact Loop Bound Analysis.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1814–37. Crossref, https://doi.org/10.1145/3729323."
  },
  {
    "doi": "10.1145/3729299",
    "title": "Functional Meaning for Parallel Streaming.",
    "venue": "pldi 2025",
    "citation": "Rioux, Nick, and Steve Zdancewic. “Functional Meaning for Parallel Streaming.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1220–44. Crossref, https://doi.org/10.1145/3729299."
  },
  {
    "doi": "10.1145/3729335",
    "title": "Modular Construction and Optimization of the UZP Sparse Format for SpMV on CPUs.",
    "venue": "pldi 2025",
    "citation": "Rodríguez-Iglesias, Alonso, et al. “Modular Construction and Optimization of the UZP Sparse Format for SpMV on CPUs.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 2106–30. Crossref, https://doi.org/10.1145/3729335."
  },
  {
    "doi": "10.1145/3729251",
    "title": "Random Variate Generation with Formal Guarantees.",
    "venue": "pldi 2025",
    "citation": "Saad, Feras A., and Wonyeol Lee. “Random Variate Generation with Formal Guarantees.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 125–49. Crossref, https://doi.org/10.1145/3729251."
  },
  {
    "doi": "10.1145/3729281",
    "title": "Intrinsic Verification of Parsers and Formal Grammar Theory in Dependent Lambek Calculus.",
    "venue": "pldi 2025",
    "citation": "Schaefer, Steven, et al. “Intrinsic Verification of Parsers and Formal Grammar Theory in Dependent Lambek Calculus.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 773–96. Crossref, https://doi.org/10.1145/3729281."
  },
  {
    "doi": "10.1145/3729326",
    "title": "Slotted E-Graphs: First-Class Support for (Bound) Variables in E-Graphs.",
    "venue": "pldi 2025",
    "citation": "Schneider, Rudi, et al. “Slotted E-Graphs: First-Class Support for (Bound) Variables in E-Graphs.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1888–910. Crossref, https://doi.org/10.1145/3729326."
  },
  {
    "doi": "10.1145/3729253",
    "title": "Optimizing Ancilla-Based Quantum Circuits with SPARE.",
    "venue": "pldi 2025",
    "citation": "Sharma, Ritvik, and Sara Achour. “Optimizing Ancilla-Based Quantum Circuits with SPARE.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 176–200. Crossref, https://doi.org/10.1145/3729253."
  },
  {
    "doi": "10.1145/3729284",
    "title": "Destabilizing Iris.",
    "venue": "pldi 2025",
    "citation": "Spies, Simon, et al. “Destabilizing Iris.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 848–73. Crossref, https://doi.org/10.1145/3729284."
  },
  {
    "doi": "10.1145/3729297",
    "title": "Taking Out the Toxic Trash: Recovering Precision in Mixed Flow-Sensitive Static Analyses.",
    "venue": "pldi 2025",
    "citation": "Stemmler, Fabian, et al. “Taking Out the Toxic Trash: Recovering Precision in Mixed Flow-Sensitive Static Analyses.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1167–93. Crossref, https://doi.org/10.1145/3729297."
  },
  {
    "doi": "10.1145/3729313",
    "title": "Dynamic Region Ownership for Concurrency Safety.",
    "venue": "pldi 2025",
    "citation": "Stoldt, Fridtjof Peer, et al. “Dynamic Region Ownership for Concurrency Safety.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1565–90. Crossref, https://doi.org/10.1145/3729313."
  },
  {
    "doi": "10.1145/3729290",
    "title": "QVM: Quantum Gate Virtualization Machine.",
    "venue": "pldi 2025",
    "citation": "Tornow, Nathaniel, et al. “QVM: Quantum Gate Virtualization Machine.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 993–1018. Crossref, https://doi.org/10.1145/3729290."
  },
  {
    "doi": "10.1145/3735592",
    "title": "Tree Borrows.",
    "venue": "pldi 2025",
    "citation": "Villani, Neven, et al. “Tree Borrows.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1019–42. Crossref, https://doi.org/10.1145/3735592."
  },
  {
    "doi": "10.1145/3729282",
    "title": "Reductive Analysis with Compiler-Guided Large Language Models for Input-Centric Code Optimizations.",
    "venue": "pldi 2025",
    "citation": "Wang, Xiangwei, et al. “Reductive Analysis with Compiler-Guided Large Language Models for Input-Centric Code Optimizations.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 797–821. Crossref, https://doi.org/10.1145/3729282."
  },
  {
    "doi": "10.1145/3729287",
    "title": "Program Skeletons for Automated Program Translation.",
    "venue": "pldi 2025",
    "citation": "Wang, Bo, et al. “Program Skeletons for Automated Program Translation.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 920–44. Crossref, https://doi.org/10.1145/3729287."
  },
  {
    "doi": "10.1145/3729254",
    "title": "Relaxing Alias Analysis: Exploring the Unexplored Space.",
    "venue": "pldi 2025",
    "citation": "Weber, Michel, et al. “Relaxing Alias Analysis: Exploring the Unexplored Space.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 201–24. Crossref, https://doi.org/10.1145/3729254."
  },
  {
    "doi": "10.1145/3729305",
    "title": "Divergence-Aware Testing of Graphics Shader Compiler Back-Ends.",
    "venue": "pldi 2025",
    "citation": "Xiao, Dongwei, et al. “Divergence-Aware Testing of Graphics Shader Compiler Back-Ends.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1367–91. Crossref, https://doi.org/10.1145/3729305."
  },
  {
    "doi": "10.1145/3729262",
    "title": "Task-Based Tensor Computations on Modern GPUs.",
    "venue": "pldi 2025",
    "citation": "Yadav, Rohan, et al. “Task-Based Tensor Computations on Modern GPUs.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 396–420. Crossref, https://doi.org/10.1145/3729262."
  },
  {
    "doi": "10.1145/3729315",
    "title": "Scalable, Validated Code Translation of Entire Projects using Large Language Models.",
    "venue": "pldi 2025",
    "citation": "Zhang, Hanliang, et al. “Scalable, Validated Code Translation of Entire Projects Using Large Language Models.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1616–41. Crossref, https://doi.org/10.1145/3729315."
  },
  {
    "doi": "10.1145/3729252",
    "title": "Efficient Timestamping for Sampling-Based Race Detection.",
    "venue": "pldi 2025",
    "citation": "Zhang, Minjian, et al. “Efficient Timestamping for Sampling-Based Race Detection.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 150–75. Crossref, https://doi.org/10.1145/3729252."
  },
  {
    "doi": "10.1145/3729276",
    "title": "CompCertOC: Verified Compositional Compilation of Multi-threaded Programs with Shared Stacks.",
    "venue": "pldi 2025",
    "citation": "Zhang, Ling, et al. “CompCertOC: Verified Compositional Compilation of Multi-Threaded Programs with Shared Stacks.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 651–74. Crossref, https://doi.org/10.1145/3729276."
  },
  {
    "doi": "10.1145/3729283",
    "title": "Quantum Register Machine: Efficient Implementation of Quantum Recursive Programs.",
    "venue": "pldi 2025",
    "citation": "Zhang, Zhicheng, and Mingsheng Ying. “Quantum Register Machine: Efficient Implementation of Quantum Recursive Programs.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 822–47. Crossref, https://doi.org/10.1145/3729283."
  },
  {
    "doi": "10.1145/3729303",
    "title": "Polygon: Symbolic Reasoning for SQL using Conflict-Driven Under-Approximation Search.",
    "venue": "pldi 2025",
    "citation": "Zhao, Pinhan, et al. “Polygon: Symbolic Reasoning for SQL Using Conflict-Driven Under-Approximation Search.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 1315–40. Crossref, https://doi.org/10.1145/3729303."
  },
  {
    "doi": "10.1145/3729278",
    "title": "Fast Direct Manipulation Programming with Patch-Reconciliation Correspondence.",
    "venue": "pldi 2025",
    "citation": "Ziegler, Parker, et al. “Fast Direct Manipulation Programming with Patch-Reconciliation Correspondence.” Proceedings of the ACM on Programming Languages, vol. 9, no. PLDI, June 2025, pp. 699–724. Crossref, https://doi.org/10.1145/3729278."
  },
  {
    "doi": "10.1145/3720473",
    "title": "Finch: Sparse and Structured Tensor Programming with Control Flow.",
    "venue": "oopsla 2025",
    "citation": "Ahrens, Willow, et al. “Finch: Sparse and Structured Tensor Programming with Control Flow.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1042–72. Crossref, https://doi.org/10.1145/3720473."
  },
  {
    "doi": "10.1145/3720424",
    "title": "Denotational Foundations for Expected Cost Analysis.",
    "venue": "oopsla 2025",
    "citation": "Azevedo de Amorim, Pedro H. “Denotational Foundations for Expected Cost Analysis.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 280–306. Crossref, https://doi.org/10.1145/3720424."
  },
  {
    "doi": "10.1145/3720486",
    "title": "Revealing Sources of (Memory) Errors via Backward Analysis.",
    "venue": "oopsla 2025",
    "citation": "Ascari, Flavio, et al. “Revealing Sources of (Memory) Errors via Backward Analysis.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1321–48. Crossref, https://doi.org/10.1145/3720486."
  },
  {
    "doi": "10.1145/3720423",
    "title": "Destination Calculus: A Linear 𝜆-Calculus for Purely Functional Memory Writes.",
    "venue": "oopsla 2025",
    "citation": "Bagrel, Thomas, and Arnaud Spiwack. “Destination Calculus: A Linear 𝜆-Calculus for Purely Functional Memory Writes.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 253–79. Crossref, https://doi.org/10.1145/3720423."
  },
  {
    "doi": "10.1145/3720429",
    "title": "Foundations for Deductive Verification of Continuous Probabilistic Programs: From Lebesgue to Riemann and Back.",
    "venue": "oopsla 2025",
    "citation": "Batz, Kevin, et al. “Foundations for Deductive Verification of Continuous Probabilistic Programs: From Lebesgue to Riemann and Back.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 421–48. Crossref, https://doi.org/10.1145/3720429."
  },
  {
    "doi": "10.1145/3720427",
    "title": "Carapace: Static-Dynamic Information Flow Control in Rust.",
    "venue": "oopsla 2025",
    "citation": "Beardsley, Vincent, et al. “Carapace: Static–Dynamic Information Flow Control in Rust.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 364–92. Crossref, https://doi.org/10.1145/3720427."
  },
  {
    "doi": "10.1145/3720497",
    "title": "Polymorphic Records for Dynamic Languages.",
    "venue": "oopsla 2025",
    "citation": "Castagna, Giuseppe, and Loïc Peyrot. “Polymorphic Records for Dynamic Languages.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1464–91. Crossref, https://doi.org/10.1145/3720497."
  },
  {
    "doi": "10.1145/3720500",
    "title": "Scaling Optimization over Uncertainty via Compilation.",
    "venue": "oopsla 2025",
    "citation": "Cho, Minsung, et al. “Scaling Optimization over Uncertainty via Compilation.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1546–74. Crossref, https://doi.org/10.1145/3720500."
  },
  {
    "doi": "10.1145/3720421",
    "title": "Code Style Sheets: CSS for Code.",
    "venue": "oopsla 2025",
    "citation": "Cohen, Sam, and Ravi Chugh. “Code Style Sheets: CSS for Code.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 196–224. Crossref, https://doi.org/10.1145/3720421."
  },
  {
    "doi": "10.1145/3720474",
    "title": "KestRel: Relational Verification using E-Graphs for Program Alignment.",
    "venue": "oopsla 2025",
    "citation": "Dickerson, Robert, et al. “KestRel: Relational Verification Using E-Graphs for Program Alignment.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1073–100. Crossref, https://doi.org/10.1145/3720474."
  },
  {
    "doi": "10.1145/3720422",
    "title": "Fast Constraint Synthesis for C++ Function Templates.",
    "venue": "oopsla 2025",
    "citation": "Ding, Shuo, and Qirun Zhang. “Fast Constraint Synthesis for C++ Function Templates.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 225–52. Crossref, https://doi.org/10.1145/3720422."
  },
  {
    "doi": "10.1145/3720448",
    "title": "Metamorph: Synthesizing Large Objects from Dafny Specifications.",
    "venue": "oopsla 2025",
    "citation": "Fedchin, Aleksandr, et al. “Metamorph: Synthesizing Large Objects from Dafny Specifications.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 759–85. Crossref, https://doi.org/10.1145/3720448."
  },
  {
    "doi": "10.1145/3720450",
    "title": "Adaptive Shielding via Parametric Safety Proofs.",
    "venue": "oopsla 2025",
    "citation": "Feng, Yao, et al. “Adaptive Shielding via Parametric Safety Proofs.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 816–43. Crossref, https://doi.org/10.1145/3720450."
  },
  {
    "doi": "10.1145/3720437",
    "title": "Type-Preserving Flat Closure Optimization.",
    "venue": "oopsla 2025",
    "citation": "Geller, Adam T., et al. “Type-Preserving Flat Closure Optimization.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 649–75. Crossref, https://doi.org/10.1145/3720437."
  },
  {
    "doi": "10.1145/3720506",
    "title": "Compressed and Parallelized Structured Tensor Algebra.",
    "venue": "oopsla 2025",
    "citation": "Ghorbani, Mahdi, et al. “Compressed and Parallelized Structured Tensor Algebra.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1717–45. Crossref, https://doi.org/10.1145/3720506."
  },
  {
    "doi": "10.1145/3720431",
    "title": "Scalable and Accurate Application-Level Crash-Consistency Testing via Representative Testing.",
    "venue": "oopsla 2025",
    "citation": "Gu, Yile, et al. “Scalable and Accurate Application-Level Crash-Consistency Testing via Representative Testing.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 477–506. Crossref, https://doi.org/10.1145/3720431."
  },
  {
    "doi": "10.1145/3720503",
    "title": "SPLAT: A Framework for Optimised GPU Code-Generation for SParse reguLar ATtention.",
    "venue": "oopsla 2025",
    "citation": "Gupta, Ahan, et al. “SPLAT: A Framework for Optimised GPU Code-Generation for SParse reguLar ATtention.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1632–60. Crossref, https://doi.org/10.1145/3720503."
  },
  {
    "doi": "10.1145/3720505",
    "title": "Counterexample-Guided Inference of Modular Specifications.",
    "venue": "oopsla 2025",
    "citation": "Hallahan, William T., et al. “Counterexample-Guided Inference of Modular Specifications.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1689–716. Crossref, https://doi.org/10.1145/3720505."
  },
  {
    "doi": "10.1145/3720415",
    "title": "Binary Cryptographic Function Identification via Similarity Analysis with Path-Insensitive Emulation.",
    "venue": "oopsla 2025",
    "citation": "Hu, Yikun, et al. “Binary Cryptographic Function Identification via Similarity Analysis with Path-Insensitive Emulation.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 28–56. Crossref, https://doi.org/10.1145/3720415."
  },
  {
    "doi": "10.1145/3720488",
    "title": "Artemis: Toward Accurate Detection of Server-Side Request Forgeries through LLM-Assisted Inter-procedural Path-Sensitive Taint Analysis.",
    "venue": "oopsla 2025",
    "citation": "Ji, Yuchen, et al. “Artemis: Toward Accurate Detection of Server-Side Request Forgeries through LLM-Assisted Inter-Procedural Path-Sensitive Taint Analysis.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1349–77. Crossref, https://doi.org/10.1145/3720488."
  },
  {
    "doi": "10.1145/3720434",
    "title": "Notions of Stack-Manipulating Computation and Relative Monads.",
    "venue": "oopsla 2025",
    "citation": "Jiang, Yuchen, et al. “Notions of Stack-Manipulating Computation and Relative Monads.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 563–89. Crossref, https://doi.org/10.1145/3720434."
  },
  {
    "doi": "10.1145/3720480",
    "title": "Guarding the Privacy of Label-Only Access to Neural Network Classifiers via iDP Verification.",
    "venue": "oopsla 2025",
    "citation": "Kabaha, Anan, and Dana Drachsler Cohen. “Guarding the Privacy of Label-Only Access to Neural Network Classifiers via iDP Verification.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1184–212. Crossref, https://doi.org/10.1145/3720480."
  },
  {
    "doi": "10.1145/3720457",
    "title": "Adequacy for Algebraic Effects Revisited.",
    "venue": "oopsla 2025",
    "citation": "Kavvos, G. A. “Adequacy for Algebraic Effects Revisited.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 927–55. Crossref, https://doi.org/10.1145/3720457."
  },
  {
    "doi": "10.1145/3720526",
    "title": "PAFL: Enhancing Fault Localizers by Leveraging Project-Specific Fault Patterns.",
    "venue": "oopsla 2025",
    "citation": "Kim, Donguk, et al. “PAFL: Enhancing Fault Localizers by Leveraging Project-Specific Fault Patterns.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1378–405. Crossref, https://doi.org/10.1145/3720526."
  },
  {
    "doi": "10.1145/3720515",
    "title": "Semantics of Sets of Programs.",
    "venue": "oopsla 2025",
    "citation": "Kim, Jinwoo, et al. “Semantics of Sets of Programs.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 844–70. Crossref, https://doi.org/10.1145/3720515."
  },
  {
    "doi": "10.1145/3720513",
    "title": "Peepco: Batch-Based Consistency Optimization.",
    "venue": "oopsla 2025",
    "citation": "Kuraj, Ivan, et al. “Peepco: Batch-Based Consistency Optimization.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1101–29. Crossref, https://doi.org/10.1145/3720513."
  },
  {
    "doi": "10.1145/3720432",
    "title": "A Mechanized Semantics for Dataflow Circuits.",
    "venue": "oopsla 2025",
    "citation": "Law, Tony, et al. “A Mechanized Semantics for Dataflow Circuits.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 507–33. Crossref, https://doi.org/10.1145/3720432."
  },
  {
    "doi": "10.1145/3720525",
    "title": "Lilo: A Higher-Order, Relational Concurrent Separation Logic for Liveness.",
    "venue": "oopsla 2025",
    "citation": "Lee, Dongjae, et al. “Lilo: A Higher-Order, Relational Concurrent Separation Logic for Liveness.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1267–94. Crossref, https://doi.org/10.1145/3720525."
  },
  {
    "doi": "10.1145/3720502",
    "title": "Bolt-On Strong Consistency: Specification, Implementation, and Verification.",
    "venue": "oopsla 2025",
    "citation": "Lewchenko, Nicholas V., et al. “Bolt-On Strong Consistency: Specification, Implementation, and Verification.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1604–31. Crossref, https://doi.org/10.1145/3720502."
  },
  {
    "doi": "10.1145/3720498",
    "title": "Efficient Algorithms for the Uniform Tokenization Problem.",
    "venue": "oopsla 2025",
    "citation": "Li, Angela W., and Konstantinos Mamouras. “Efficient Algorithms for the Uniform Tokenization Problem.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1492–518. Crossref, https://doi.org/10.1145/3720498."
  },
  {
    "doi": "10.1145/3720493",
    "title": "Characterizing Implementability of Global Protocols with Infinite States and Data.",
    "venue": "oopsla 2025",
    "citation": "Li, Elaine, et al. “Characterizing Implementability of Global Protocols with Infinite States and Data.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1434–63. Crossref, https://doi.org/10.1145/3720493."
  },
  {
    "doi": "10.1145/3720449",
    "title": "API-Guided Dataset Synthesis to Finetune Large Code Models.",
    "venue": "oopsla 2025",
    "citation": "Li, Zongjie, et al. “API-Guided Dataset Synthesis to Finetune Large Code Models.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 786–815. Crossref, https://doi.org/10.1145/3720449."
  },
  {
    "doi": "10.1145/3720508",
    "title": "Combining Formal and Informal Information in Bayesian Program Analysis via Soft Evidences.",
    "venue": "oopsla 2025",
    "citation": "Li, Tianchi, and Xin Zhang. “Combining Formal and Informal Information in Bayesian Program Analysis via Soft Evidences.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1774–801. Crossref, https://doi.org/10.1145/3720508."
  },
  {
    "doi": "10.1145/3720492",
    "title": "Automatic Linear Resource Bound Analysis for Rust via Prophecy Potentials.",
    "venue": "oopsla 2025",
    "citation": "Lian, Qihao, and Di Wang. “Automatic Linear Resource Bound Analysis for Rust via Prophecy Potentials.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1406–33. Crossref, https://doi.org/10.1145/3720492."
  },
  {
    "doi": "10.1145/3720435",
    "title": "Soundness of Predictive Concurrency Analyses.",
    "venue": "oopsla 2025",
    "citation": "Liu, Shuyang, et al. “Soundness of Predictive Concurrency Analyses.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 590–616. Crossref, https://doi.org/10.1145/3720435."
  },
  {
    "doi": "10.1145/3720484",
    "title": "The Simulation Semantics of Synthesisable Verilog.",
    "venue": "oopsla 2025",
    "citation": "Lööw, Andreas. “The Simulation Semantics of Synthesisable Verilog.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1295–320. Crossref, https://doi.org/10.1145/3720484."
  },
  {
    "doi": "10.1145/3720472",
    "title": "The Simple Essence of Monomorphization.",
    "venue": "oopsla 2025",
    "citation": "Lutze, Matthew, et al. “The Simple Essence of Monomorphization.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1015–41. Crossref, https://doi.org/10.1145/3720472."
  },
  {
    "doi": "10.1145/3720416",
    "title": "Dependency-Aware Compilation for Surface Code Quantum Architectures.",
    "venue": "oopsla 2025",
    "citation": "Molavi, Abtin, et al. “Dependency-Aware Compilation for Surface Code Quantum Architectures.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 57–84. Crossref, https://doi.org/10.1145/3720416."
  },
  {
    "doi": "10.1145/3720499",
    "title": "Laurel: Unblocking Automated Verification with Large Language Models.",
    "venue": "oopsla 2025",
    "citation": "Mugnier, Eric, et al. “Laurel: Unblocking Automated Verification with Large Language Models.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1519–45. Crossref, https://doi.org/10.1145/3720499."
  },
  {
    "doi": "10.1145/3720447",
    "title": "FO-Complete Program Verification for Heap Logics.",
    "venue": "oopsla 2025",
    "citation": "Murali, Adithya, et al. “FO-Complete Program Verification for Heap Logics.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 730–58. Crossref, https://doi.org/10.1145/3720447."
  },
  {
    "doi": "10.1145/3720436",
    "title": "IncIDFA: An Efficient and Generic Algorithm for Incremental Iterative Dataflow Analysis.",
    "venue": "oopsla 2025",
    "citation": "Nougrahiya, Aman, and V. Krishna Nandivada. “IncIDFA: An Efficient and Generic Algorithm for Incremental Iterative Dataflow Analysis.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 617–48. Crossref, https://doi.org/10.1145/3720436."
  },
  {
    "doi": "10.1145/3720470",
    "title": "LOUD: Synthesizing Strongest and Weakest Specifications.",
    "venue": "oopsla 2025",
    "citation": "Park, Kanghee, et al. “LOUD: Synthesizing Strongest and Weakest Specifications.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 956–83. Crossref, https://doi.org/10.1145/3720470."
  },
  {
    "doi": "10.1145/3720524",
    "title": "Bridging the Gap between Real-World and Formal Binary Lifting through Filtered-Simulation.",
    "venue": "oopsla 2025",
    "citation": "Park, Jihee, et al. “Bridging the Gap between Real-World and Formal Binary Lifting through Filtered-Simulation.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 898–926. Crossref, https://doi.org/10.1145/3720524."
  },
  {
    "doi": "10.1145/3720433",
    "title": "QbC: Quantum Correctness by Construction.",
    "venue": "oopsla 2025",
    "citation": "Peduri, Anurudh, et al. “QbC: Quantum Correctness by Construction.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 534–62. Crossref, https://doi.org/10.1145/3720433."
  },
  {
    "doi": "10.1145/3720481",
    "title": "Language-Parametric Reference Synthesis.",
    "venue": "oopsla 2025",
    "citation": "Pelsmaeker, Daniel A. A., et al. “Language-Parametric Reference Synthesis.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1213–38. Crossref, https://doi.org/10.1145/3720481."
  },
  {
    "doi": "10.1145/3720504",
    "title": "Checking Observational Correctness of Database Systems.",
    "venue": "oopsla 2025",
    "citation": "Pick, Lauren, et al. “Checking Observational Correctness of Database Systems.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1661–88. Crossref, https://doi.org/10.1145/3720504."
  },
  {
    "doi": "10.1145/3720419",
    "title": "UTFix: Change Aware Unit Test Repairing using LLM.",
    "venue": "oopsla 2025",
    "citation": "Rahman, Shanto, et al. “UTFix: Change Aware Unit Test Repairing Using LLM.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 143–68. Crossref, https://doi.org/10.1145/3720419."
  },
  {
    "doi": "10.1145/3720428",
    "title": "Unveiling Heisenbugs with Diversified Execution.",
    "venue": "oopsla 2025",
    "citation": "Ramesh, Arjun, et al. “Unveiling Heisenbugs with Diversified Execution.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 393–420. Crossref, https://doi.org/10.1145/3720428."
  },
  {
    "doi": "10.1145/3721089",
    "title": "Symbolic MRD: Dynamic Memory, Undefined Behaviour, and Extrinsic Choice.",
    "venue": "oopsla 2025",
    "citation": "Richards, Jay, et al. “Symbolic MRD: Dynamic Memory, Undefined Behaviour, and Extrinsic Choice.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1858–82. Crossref, https://doi.org/10.1145/3721089."
  },
  {
    "doi": "10.1145/3720446",
    "title": "Checking δ-Satisfiability of Reals with Integrals.",
    "venue": "oopsla 2025",
    "citation": "Rivera, Cody, et al. “Checking δ-Satisfiability of Reals with Integrals.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 704–29. Crossref, https://doi.org/10.1145/3720446."
  },
  {
    "doi": "10.1145/3720507",
    "title": "Compiling Classical Sequent Calculus to Stock Hardware: The Duality of Compilation.",
    "venue": "oopsla 2025",
    "citation": "Schuster, Philipp, et al. “Compiling Classical Sequent Calculus to Stock Hardware: The Duality of Compilation.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1746–73. Crossref, https://doi.org/10.1145/3720507."
  },
  {
    "doi": "10.1145/3720426",
    "title": "QED in Context: An Observation Study of Proof Assistant Users.",
    "venue": "oopsla 2025",
    "citation": "Shi, Jessica, et al. “QED in Context: An Observation Study of Proof Assistant Users.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 337–63. Crossref, https://doi.org/10.1145/3720426."
  },
  {
    "doi": "10.1145/3720509",
    "title": "Automated Verification of Soundness of DNN Certifiers.",
    "venue": "oopsla 2025",
    "citation": "Singh, Avaljot, et al. “Automated Verification of Soundness of DNN Certifiers.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1802–30. Crossref, https://doi.org/10.1145/3720509."
  },
  {
    "doi": "10.1145/3720430",
    "title": "Pathological Cases for a Class of Reachability-Based Garbage Collectors.",
    "venue": "oopsla 2025",
    "citation": "Sotoudeh, Matthew. “Pathological Cases for a Class of Reachability-Based Garbage Collectors.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 449–76. Crossref, https://doi.org/10.1145/3720430."
  },
  {
    "doi": "10.1145/3720452",
    "title": "Automatically Verifying Replication-Aware Linearizability.",
    "venue": "oopsla 2025",
    "citation": "Soundarapandian, Vimala, et al. “Automatically Verifying Replication-Aware Linearizability.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 871–97. Crossref, https://doi.org/10.1145/3720452."
  },
  {
    "doi": "10.1145/3720482",
    "title": "Multi-Language Probabilistic Programming.",
    "venue": "oopsla 2025",
    "citation": "Stites, Sam, et al. “Multi-Language Probabilistic Programming.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1239–66. Crossref, https://doi.org/10.1145/3720482."
  },
  {
    "doi": "10.1145/3720476",
    "title": "Modal Effect Types.",
    "venue": "oopsla 2025",
    "citation": "Tang, Wenhao, et al. “Modal Effect Types.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1130–57. Crossref, https://doi.org/10.1145/3720476."
  },
  {
    "doi": "10.1145/3720425",
    "title": "Hambazi: Spatial Coordination Synthesis for Augmented Reality.",
    "venue": "oopsla 2025",
    "citation": "Tsai, Yi-Zhen, et al. “Hambazi: Spatial Coordination Synthesis for Augmented Reality.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 307–36. Crossref, https://doi.org/10.1145/3720425."
  },
  {
    "doi": "10.1145/3720418",
    "title": "JavART: A Lightweight Rule-Based JIT Compiler using Translation Rules Extracted from a Learning Approach.",
    "venue": "oopsla 2025",
    "citation": "Wang, Hanzhang, et al. “JavART: A Lightweight Rule-Based JIT Compiler Using Translation Rules Extracted from a Learning Approach.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 113–42. Crossref, https://doi.org/10.1145/3720418."
  },
  {
    "doi": "10.1145/3720510",
    "title": "Show Me Why It&apos;s Correct: Saving 1/3 of Debugging Time in Program Repair with Interactive Runtime Comparison.",
    "venue": "oopsla 2025",
    "citation": "Wang, Ruixin, et al. “Show Me Why It’s Correct: Saving 1/3 of Debugging Time in Program Repair with Interactive Runtime Comparison.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1831–57. Crossref, https://doi.org/10.1145/3720510."
  },
  {
    "doi": "10.1145/3720501",
    "title": "A Unifying Approach to Product Constructions for Quantitative Temporal Inference.",
    "venue": "oopsla 2025",
    "citation": "Watanabe, Kazuki, et al. “A Unifying Approach to Product Constructions for Quantitative Temporal Inference.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1575–603. Crossref, https://doi.org/10.1145/3720501."
  },
  {
    "doi": "10.1145/3720478",
    "title": "HpC: A Calculus for Hybrid and Mobile Systems.",
    "venue": "oopsla 2025",
    "citation": "Xu, Xiong, et al. “HpC: A Calculus for Hybrid and Mobile Systems.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1158–83. Crossref, https://doi.org/10.1145/3720478."
  },
  {
    "doi": "10.1145/3720420",
    "title": "Inductive Synthesis of Inductive Heap Predicates.",
    "venue": "oopsla 2025",
    "citation": "Yang, Ziyi, and Ilya Sergey. “Inductive Synthesis of Inductive Heap Predicates.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 169–95. Crossref, https://doi.org/10.1145/3720420."
  },
  {
    "doi": "10.1145/3720414",
    "title": "A Complete Formal Semantics of eBPF Instruction Set Architecture for Solana.",
    "venue": "oopsla 2025",
    "citation": "Yuan, Shenghao, et al. “A Complete Formal Semantics of eBPF Instruction Set Architecture for Solana.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 1–27. Crossref, https://doi.org/10.1145/3720414."
  },
  {
    "doi": "10.1145/3720471",
    "title": "Verification of Bit-Flip Attacks against Quantized Neural Networks.",
    "venue": "oopsla 2025",
    "citation": "Zhang, Yedi, et al. “Verification of Bit-Flip Attacks against Quantized Neural Networks.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 984–1014. Crossref, https://doi.org/10.1145/3720471."
  },
  {
    "doi": "10.1145/3720417",
    "title": "Efficient Incremental Verification of Neural Networks Guided by Counterexample Potentiality.",
    "venue": "oopsla 2025",
    "citation": "Zhang, Guanqin, et al. “Efficient Incremental Verification of Neural Networks Guided by Counterexample Potentiality.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 85–112. Crossref, https://doi.org/10.1145/3720417."
  },
  {
    "doi": "10.1145/3720438",
    "title": "Orax: A Feedback-Driven Framework for Efficiently Solving Satisfiability Modulo Theories and Oracles.",
    "venue": "oopsla 2025",
    "citation": "Zhong, Zhineng, et al. “Orax: A Feedback-Driven Framework for Efficiently Solving Satisfiability Modulo Theories and Oracles.” Proceedings of the ACM on Programming Languages, vol. 9, no. OOPSLA1, Apr. 2025, pp. 676–703. Crossref, https://doi.org/10.1145/3720438."
  }
]
