{"https://doi.org/10.1145/3571229":{"mla":"Jacobs, Jules, and Stephanie Balzer. “Higher-Order Leak and Deadlock Free Locks.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1027–57. Crossref, https://doi.org/10.1145/3571229."},"https://doi.org/10.1145/3571264":{"mla":"Sekiyama, Taro, and Hiroshi Unno. “Temporal Verification with Answer-Effect Modification: Dependent Temporal Type-and-Effect System with Delimited Continuations.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 2079–110. Crossref, https://doi.org/10.1145/3571264."},"https://doi.org/10.1145/3571241":{"mla":"Zhou, Litao, et al. “Recursive Subtyping for All.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1396–425. Crossref, https://doi.org/10.1145/3571241."},"https://doi.org/10.1145/3571212":{"mla":"Kokologiannakis, Michalis, et al. “Kater: Automating Weak Memory Model Metatheory and Consistency Checking.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 544–72. Crossref, https://doi.org/10.1145/3571212."},"https://doi.org/10.1145/3571242":{"mla":"Farzan, Azadeh, et al. “Stratified Commutativity in Verification Algorithms for Concurrent Programs.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1426–53. Crossref, https://doi.org/10.1145/3571242."},"https://doi.org/10.1145/3571248":{"mla":"Di Giusto, Cinzia, et al. “A Partial Order View of Message-Passing Communication Models.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1601–27. Crossref, https://doi.org/10.1145/3571248."},"https://doi.org/10.1145/3571218":{"mla":"Moine, Alexandre, et al. “A High-Level Separation Logic for Heap Space under Garbage Collection.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 718–47. Crossref, https://doi.org/10.1145/3571218."},"https://doi.org/10.1145/3571194":{"mla":"Pulte, Christopher, et al. “CN: Verifying Systems C Code with Separation-Logic Refinement Types.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1–32. Crossref, https://doi.org/10.1145/3571194."},"https://doi.org/10.1145/3571232":{"mla":"Song, Youngju, et al. “Conditional Contextual Refinement.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1121–51. Crossref, https://doi.org/10.1145/3571232."},"https://doi.org/10.1145/3571227":{"mla":"Ding, Shuo, and Qirun Zhang. “Witnessability of Undecidable Problems.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 982–1002. Crossref, https://doi.org/10.1145/3571227."},"https://doi.org/10.1145/3571203":{"mla":"Day, Joel D., et al. “On the Expressive Power of String Constraints.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 278–308. Crossref, https://doi.org/10.1145/3571203."},"https://doi.org/10.1145/3571230":{"mla":"Alur, Rajeev, et al. “A Robust Theory of Series Parallel Graphs.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1058–88. Crossref, https://doi.org/10.1145/3571230."},"https://doi.org/10.1145/3571208":{"mla":"Michael, Alexandra E., et al. “MSWasm: Soundly Enforcing Memory-Safe Execution of Unsafe Code.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 425–54. Crossref, https://doi.org/10.1145/3571208."},"https://doi.org/10.1145/3571740":{"mla":"Hunt, Sebastian, et al. “Reconciling Shannon and Scott with a Lattice of Computable Information.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1987–2016. Crossref, https://doi.org/10.1145/3571740."},"https://doi.org/10.1145/3571223":{"mla":"Gancher, Joshua, et al. “A Core Calculus for Equational Proofs of Cryptographic Protocols.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 866–92. Crossref, https://doi.org/10.1145/3571223."},"https://doi.org/10.1145/3571263":{"mla":"Lee, Woosuk, and Hangyeol Cho. “Inductive Synthesis of Structurally Recursive Functional Programs from Non-Recursive Expressions.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 2048–78. Crossref, https://doi.org/10.1145/3571263."},"https://doi.org/10.1145/3571226":{"mla":"Cambronero, José, et al. “FlashFill++: Scaling Programming by Example by Cutting to the Chase.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 952–81. Crossref, https://doi.org/10.1145/3571226."},"https://doi.org/10.1145/3571216":{"mla":"Kim, Jinwoo, et al. “Unrealizability Logic.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 659–88. Crossref, https://doi.org/10.1145/3571216."},"https://doi.org/10.1145/3571220":{"mla":"Sammler, Michael, et al. “DimSum: A Decentralized Approach to Multi-Language Semantics and Verification.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 775–805. Crossref, https://doi.org/10.1145/3571220."},"https://doi.org/10.1145/3571202":{"mla":"Barrière, Aurèle, et al. “Formally Verified Native Code Generation in an Effectful JIT: Turning the CompCert Backend into a Formally Verified JIT Compiler.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 249–77. Crossref, https://doi.org/10.1145/3571202."},"https://doi.org/10.1145/3571240":{"mla":"Chen, Zilin, et al. “Dargent: A Silver Bullet for Verified Data Layout Refinement.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1369–95. Crossref, https://doi.org/10.1145/3571240."},"https://doi.org/10.1145/3571239":{"mla":"Dash, Swaraj, et al. “Affine Monads and Lazy Structures for Bayesian Programming.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1338–68. Crossref, https://doi.org/10.1145/3571239."},"https://doi.org/10.1145/3571243":{"mla":"Li, Jianlin, et al. “Type-Preserving, Dependence-Aware Guide Generation for Sound, Effective Amortized Probabilistic Inference.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1454–82. Crossref, https://doi.org/10.1145/3571243."},"https://doi.org/10.1145/3571205":{"mla":"Lee, Wonyeol, et al. “Smoothness Analysis for Probabilistic Programs with Application to Optimised Variational Inference.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 335–66. Crossref, https://doi.org/10.1145/3571205."},"https://doi.org/10.1145/3571196":{"mla":"Abreu, Pedro, et al. “A Type-Based Approach to Divide-and-Conquer Recursion in Coq.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 61–90. Crossref, https://doi.org/10.1145/3571196."},"https://doi.org/10.1145/3571256":{"mla":"Gavazzo, Francesco, and Cecilia Di Florio. “Elements of Quantitative Rewriting.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1832–63. Crossref, https://doi.org/10.1145/3571256."},"https://doi.org/10.1145/3571217":{"mla":"Castellan, Simon, and Pierre Clairambault. “The Geometry of Causality: Multi-Token Geometry of Interaction and Its Causal Unfolding.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 689–717. Crossref, https://doi.org/10.1145/3571217."},"https://doi.org/10.1145/3571257":{"mla":"Bonchi, Filippo, et al. “Deconstructing the Calculus of Relations with Tape Diagrams.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1864–94. Crossref, https://doi.org/10.1145/3571257."},"https://doi.org/10.1145/3571207":{"mla":"Cao, David, et al. “Babble: Learning Better Abstractions with E-Graphs and Anti-Unification.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 396–424. Crossref, https://doi.org/10.1145/3571207."},"https://doi.org/10.1145/3571249":{"mla":"Das, Ria, et al. “Combining Functional and Automata Synthesis to Discover Causal Reactive Programs.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1628–58. Crossref, https://doi.org/10.1145/3571249."},"https://doi.org/10.1145/3571197":{"mla":"Wang, Yanjun, et al. “Comparative Synthesis: Learning Near-Optimal Network Designs by Query.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 91–120. Crossref, https://doi.org/10.1145/3571197."},"https://doi.org/10.1145/3571234":{"mla":"Bowers, Matthew, et al. “Top-Down Synthesis for Library Learning.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1182–213. Crossref, https://doi.org/10.1145/3571234."},"https://doi.org/10.1145/3571259":{"mla":"Das, Ankush, et al. “Probabilistic Resource-Aware Session Types.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1925–56. Crossref, https://doi.org/10.1145/3571259."},"https://doi.org/10.1145/3571260":{"mla":"Batz, Kevin, et al. “A Calculus for Amortized Expected Runtimes.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1957–86. Crossref, https://doi.org/10.1145/3571260."},"https://doi.org/10.1145/3571221":{"mla":"Hainry, Emmanuel, and Romain Péchoux. “A General Noninterference Policy for Polynomial Time.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 806–32. Crossref, https://doi.org/10.1145/3571221."},"https://doi.org/10.1145/3571258":{"mla":"Lemerre, Matthieu. “SSA Translation Is an Abstract Interpretation.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1895–924. Crossref, https://doi.org/10.1145/3571258."},"https://doi.org/10.1145/3571238":{"mla":"Thokair, Mosaad Al, et al. “Dynamic Race Detection with O(1) Samples.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1308–37. Crossref, https://doi.org/10.1145/3571238."},"https://doi.org/10.1145/3571251":{"mla":"Palmkvist, Viktor, et al. “Statically Resolvable Ambiguity.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1686–712. Crossref, https://doi.org/10.1145/3571251."},"https://doi.org/10.1145/3571235":{"mla":"Popescu, Andrei, and Dmitriy Traytel. “Admissible Types-to-PERs Relativization in Higher-Order Logic.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1214–45. Crossref, https://doi.org/10.1145/3571235."},"https://doi.org/10.1145/3571250":{"mla":"Hou (Favonia), Kuen-Bang, et al. “An Order-Theoretic Analysis of Universe Polymorphism.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1659–85. Crossref, https://doi.org/10.1145/3571250."},"https://doi.org/10.1145/3571739":{"mla":"Pujet, Loïc, and Nicolas Tabareau. “Impredicative Observational Equality.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 2171–96. Crossref, https://doi.org/10.1145/3571739."},"https://doi.org/10.1145/3571236":{"mla":"Radul, Alexey, et al. “You Only Linearize Once: Tangents Transpose to Gradients.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1246–74. Crossref, https://doi.org/10.1145/3571236."},"https://doi.org/10.1145/3571247":{"mla":"Smeding, Tom J., and Matthijs I. L. Vákár. “Efficient Dual-Numbers Reverse AD via Well-Known Program Transformations.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1573–600. Crossref, https://doi.org/10.1145/3571247."},"https://doi.org/10.1145/3571198":{"mla":"Lew, Alexander K., et al. “ADEV: Sound Automatic Differentiation of Expected Values of Probabilistic Programs.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 121–53. Crossref, https://doi.org/10.1145/3571198."},"https://doi.org/10.1145/3571211":{"mla":"Rioux, Nick, et al. “A Bowtie for a Beast: Overloading, Eta Expansion, and Extensible Data Types in F⋈.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 515–43. Crossref, https://doi.org/10.1145/3571211."},"https://doi.org/10.1145/3571224":{"mla":"Xu, Han, et al. “Making a Type Difference: Subtraction on Intersection Types as Generalized Record Operations.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 893–920. Crossref, https://doi.org/10.1145/3571224."},"https://doi.org/10.1145/3571244":{"mla":"Arrial, Victor, et al. “Quantitative Inhabitation for Different Lambda Calculi in a Unifying Framework.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1483–513. Crossref, https://doi.org/10.1145/3571244."},"https://doi.org/10.1145/3571237":{"mla":"Kincaid, Zachary, et al. “When Less Is More: Consequence-Finding in a Weak Theory of Arithmetic.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1275–307. Crossref, https://doi.org/10.1145/3571237."},"https://doi.org/10.1145/3571262":{"mla":"Jochems, Jerome, et al. “Higher-Order MSL Horn Constraints.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 2017–47. Crossref, https://doi.org/10.1145/3571262."},"https://doi.org/10.1145/3571245":{"mla":"Jacobs, Jules, and Thorsten Wißmann. “Fast Coalgebraic Bisimilarity Minimization.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1514–41. Crossref, https://doi.org/10.1145/3571245."},"https://doi.org/10.1145/3571195":{"mla":"Aguirre, Alejandro, and Lars Birkedal. “Step-Indexed Logical Relations for Countable Nondeterminism and Probabilistic Choice.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 33–60. Crossref, https://doi.org/10.1145/3571195."},"https://doi.org/10.1145/3571254":{"mla":"Chappe, Nicolas, et al. “Choice Trees: Representing Nondeterministic, Recursive, and Impure Programs in Coq.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1770–800. Crossref, https://doi.org/10.1145/3571254."},"https://doi.org/10.1145/3571255":{"mla":"Bach Poulsen, Casper, and Cas van der Rest. “Hefty Algebras: Modular Elaboration of Higher-Order Algebraic Effects.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1801–31. Crossref, https://doi.org/10.1145/3571255."},"https://doi.org/10.1145/3571225":{"mla":"Voichick, Finn, et al. “Qunity: A Unified Language for Quantum and Classical Computing.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 921–51. Crossref, https://doi.org/10.1145/3571225."},"https://doi.org/10.1145/3571204":{"mla":"Fu, Peng, et al. “Proto-Quipper with Dynamic Lifting.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 309–34. Crossref, https://doi.org/10.1145/3571204."},"https://doi.org/10.1145/3571222":{"mla":"Zhou, Li, et al. “CoqQ: Foundational Verification of Quantum Programs.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 833–65. Crossref, https://doi.org/10.1145/3571222."},"https://doi.org/10.1145/3571233":{"mla":"Leijen, Daan, and Anton Lorenzen. “Tail Recursion Modulo Context: An Equational Approach.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1152–81. Crossref, https://doi.org/10.1145/3571233."},"https://doi.org/10.1145/3571253":{"mla":"Klimis, Vasileios, et al. “Taking Back Control in an Intermediate Representation for GPU Computing.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1740–69. Crossref, https://doi.org/10.1145/3571253."},"https://doi.org/10.1145/3571206":{"mla":"Kallas, Konstantinos, et al. “Executing Microservice Applications on Serverless, Correctly.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 367–95. Crossref, https://doi.org/10.1145/3571206."},"https://doi.org/10.1145/3571265":{"mla":"Unno, Hiroshi, et al. “Modular Primal-Dual Fixpoint Logic Solving for Temporal Verification.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 2111–40. Crossref, https://doi.org/10.1145/3571265."},"https://doi.org/10.1145/3571214":{"mla":"Gu, Yu, et al. “Optimal CHC Solving via Termination Proofs.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 604–31. Crossref, https://doi.org/10.1145/3571214."},"https://doi.org/10.1145/3571200":{"mla":"Bembenek, Aaron, et al. “From SMT to ASP: Solver-Based Approaches to Solving Datalog Synthesis-as-Rule-Selection Problems.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 185–217. Crossref, https://doi.org/10.1145/3571200."},"https://doi.org/10.1145/3571246":{"mla":"Singh, Abhishek Kr, and Ori Lahav. “An Operational Approach to Library Abstraction under Relaxed Memory Concurrency.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1542–72. Crossref, https://doi.org/10.1145/3571246."},"https://doi.org/10.1145/3571219":{"mla":"D’Osualdo, Emanuele, et al. “The Path to Durable Linearizability.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 748–74. Crossref, https://doi.org/10.1145/3571219."},"https://doi.org/10.1145/3571231":{"mla":"Oliveira Vale, Arthur, et al. “A Compositional Theory of Linearizability.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1089–120. Crossref, https://doi.org/10.1145/3571231."},"https://doi.org/10.1145/3571252":{"mla":"Koutris, Paraschos, and Shaleen Deep. “The Fine-Grained Complexity of CFL Reachability.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1713–39. Crossref, https://doi.org/10.1145/3571252."},"https://doi.org/10.1145/3571228":{"mla":"Li, Yuanbo, et al. “Single-Source-Single-Target Interleaved-Dyck Reachability via Integer Linear Programming.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 1003–26. Crossref, https://doi.org/10.1145/3571228."},"https://doi.org/10.1145/3571266":{"mla":"Baumann, Pascal, et al. “Context-Bounded Verification of Context-Free Specifications.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 2141–70. Crossref, https://doi.org/10.1145/3571266."},"https://doi.org/10.1145/3571210":{"mla":"Pitts, Andrew M. “Locally Nameless Sets.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 488–514. Crossref, https://doi.org/10.1145/3571210."},"https://doi.org/10.1145/3571201":{"mla":"Kerinec, Axel, et al. “Why Are Proofs Relevant in Proof-Relevant Models?” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 218–48. Crossref, https://doi.org/10.1145/3571201."},"https://doi.org/10.1145/3571215":{"mla":"Goncharov, Sergey, et al. “Towards a Higher-Order Mathematical Operational Semantics.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 632–58. Crossref, https://doi.org/10.1145/3571215."},"https://doi.org/10.1145/3571213":{"mla":"Antonopoulos, Timos, et al. “An Algebra of Alignment for Relational Verification.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 573–603. Crossref, https://doi.org/10.1145/3571213."},"https://doi.org/10.1145/3571209":{"mla":"Lu, Sirui, and Rastislav Bodík. “Grisette: Symbolic Compilation as a Functional Programming Library.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 455–87. Crossref, https://doi.org/10.1145/3571209."},"https://doi.org/10.1145/3571199":{"mla":"Kobayashi, Naoki, et al. “HFL(Z) Validity Checking for Automated Program Verification.” Proceedings of the ACM on Programming Languages, vol. 7, no. POPL, Jan. 2023, pp. 154–84. Crossref, https://doi.org/10.1145/3571199."},"https://doi.org/10.1145/3519939.3523427":{"mla":"Chaliasos, Stefanos, et al. “Finding Typing Compiler Bugs.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523427."},"https://doi.org/10.1145/3519939.3523722":{"mla":"Greenberg, Michael, et al. “Kleene Algebra modulo Theories: A Framework for Concrete KATs.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523722."},"https://doi.org/10.1145/3519939.3523440":{"mla":"Zhao, Wenyu, et al. “Low-Latency, High-Throughput Garbage Collection.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523440."},"https://doi.org/10.1145/3519939.3523704":{"mla":"Matsushita, Yusuke, et al. “RustHornBelt: A Semantic Foundation for Functional Verification of Rust Programs with Unsafe Code.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523704."},"https://doi.org/10.1145/3519939.3523709":{"mla":"Chen, Yanju, et al. “Visualization Question Answering Using Introspective Program Synthesis.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523709."},"https://doi.org/10.1145/3519939.3523717":{"mla":"Grewal, Karuna, et al. “P4BID: Information Flow Control in P4.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523717."},"https://doi.org/10.1145/3519939.3523725":{"mla":"Guria, Sankha Narayan, et al. “ANOSY: Approximated Knowledge Synthesis with Refinement Types for Declassification.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523725."},"https://doi.org/10.1145/3519939.3523708":{"mla":"Swamy, Nikhil, et al. “Hardening Attack Surfaces with Formally Proven Binary Format Parsers.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523708."},"https://doi.org/10.1145/3519939.3523445":{"mla":"Crichton, Will, et al. “Modular Information Flow through Ownership.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523445."},"https://doi.org/10.1145/3519939.3523441":{"mla":"Ma, Haoran, et al. “Mako: A Low-Pause, High-Throughput Evacuating Collector for Memory-Disaggregated Datacenters.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523441."},"https://doi.org/10.1145/3519939.3523733":{"mla":"Dhulipala, Laxman, et al. “PaC-Trees: Supporting Parallel and Compressed Purely-Functional Collections.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523733."},"https://doi.org/10.1145/3519939.3523711":{"mla":"Dong, Rui, et al. “WebRobot: Web Robotic Process Automation Using Interactive Programming-by-Demonstration.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523711."},"https://doi.org/10.1145/3519939.3523450":{"mla":"Guo, Zheng, et al. “Type-Directed Program Synthesis for RESTful APIs.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523450."},"https://doi.org/10.1145/3519939.3523700":{"mla":"Fehr, Mathieu, et al. “IRDL: An IR Definition Language for SSA Compilers.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523700."},"https://doi.org/10.1145/3519939.3523718":{"mla":"Cho, Minki, et al. “Sequential Reasoning for Optimizing Compilers under Weak Memory Concurrency.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523718."},"https://doi.org/10.1145/3519939.3523729":{"mla":"Flückiger, Olivier, et al. “Deoptless: Speculation with Dispatched on-Stack Replacement and Specialized Continuations.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523729."},"https://doi.org/10.1145/3519939.3523429":{"mla":"Choi, Wonhyuk, et al. “Can Reactive Synthesis and Syntax-Guided Synthesis Be Friends?” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523429."},"https://doi.org/10.1145/3519939.3523726":{"mla":"Farzan, Azadeh, et al. “Recursion Synthesis with Unrealizability Witnesses.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523726."},"https://doi.org/10.1145/3517034":{"mla":"Shi, Kensen, et al. “TF-Coder: Program Synthesis for Tensor Manipulations.” ACM Transactions on Programming Languages and Systems, vol. 44, no. 2, May 2022, pp. 1–36. Crossref, https://doi.org/10.1145/3517034."},"https://doi.org/10.1145/3519939.3523716":{"mla":"Bendrissou, Bachir, et al. “‘Synthesizing Input Grammars’: A Replication Study.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523716."},"https://doi.org/10.1145/3519939.3523442":{"mla":"Ahrens, Peter, et al. “Autoscheduling for Sparse Tensor Algebra with an Asymptotic Cost Model.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523442."},"https://doi.org/10.1145/3519939.3523437":{"mla":"Yadav, Rohan, et al. “DISTAL: The Distributed Tensor Algebra Compiler.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523437."},"https://doi.org/10.1145/3519939.3523701":{"mla":"Chen, Yishen, et al. “All You Need Is Superword-Level Parallelism: Systematic Control-Flow Vectorization with SLP.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523701."},"https://doi.org/10.1145/3519939.3523714":{"mla":"Morelli, Canberk, and Jan Reineke. “Warping Cache Simulation of Polyhedral Programs.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523714."},"https://doi.org/10.1145/3519939.3523735":{"mla":"Soundarapandian, Vimala, et al. “Certified Mergeable Replicated Data Types.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523735."},"https://doi.org/10.1145/3519939.3523426":{"mla":"Houshmand, Farzin, et al. “Hamband: RDMA Replicated Data Types.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523426."},"https://doi.org/10.1145/3519939.3523724":{"mla":"Kaki, Gowtham, et al. “RunTime-Assisted Convergence in Replicated Data Types.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523724."},"https://doi.org/10.1145/3519939.3523444":{"mla":"Honoré, Wolf, et al. “Adore: Atomic Distributed Objects with Certified Reconfiguration.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523444."},"https://doi.org/10.1145/3519939.3523731":{"mla":"Jones, Eddie, et al. “CycleQ: An Efficient Basis for Cyclic Equational Reasoning.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523731."},"https://doi.org/10.1145/3519939.3523449":{"mla":"Lehmann, Daniel, and Michael Pradel. “Finding the Dwarf: Recovering Pecise Types from WebAssembly Binaries.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523449."},"https://doi.org/10.1145/3519939.3523453":{"mla":"Bruni, Roberto, et al. “Abstract Interpretation Repair.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523453."},"https://doi.org/10.1145/3519939.3523435":{"mla":"Žikelić, Đorđe, et al. “Differential Cost Analysis with Simultaneous Potentials and Anti-Potentials.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523435."},"https://doi.org/10.1145/3519939.3523443":{"mla":"Milano, Mae, et al. “A Flexible Type System for Fearless Concurrency.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523443."},"https://doi.org/10.1145/3519939.3523720":{"mla":"Chabbi, Milind, and Murali Krishna Ramanathan. “A Study of Real-World Data Races in Golang.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523720."},"https://doi.org/10.1145/3519939.3523723":{"mla":"Gorjiara, Hamed, et al. “Checking Robustness to Weak Persistency Models.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523723."},"https://doi.org/10.1145/3519939.3523727":{"mla":"Farzan, Azadeh, et al. “Sound Sequentialization for Concurrent Program Verification.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523727."},"https://doi.org/10.1145/3519939.3523452":{"mla":"Briggs, Ian, and Pavel Panchekha. “Choosing Mathematical Function Implementations for Speed and Accuracy.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523452."},"https://doi.org/10.1145/3519939.3523721":{"mla":"Beutner, Raven, et al. “Guaranteed Bounds for Posterior Inference in Universal Probabilistic Programming.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523721."},"https://doi.org/10.1145/3519939.3523447":{"mla":"Aanjaneya, Mridul, et al. “Progressive Polynomial Approximations for Fast Correctly Rounded Math Libraries.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523447."},"https://doi.org/10.1145/3519939.3523732":{"mla":"Zhang, Chenhao, et al. “Karp: A Language for NP Reductions.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523732."},"https://doi.org/10.1145/3519939.3523710":{"mla":"Schuster, Philipp, et al. “A Typed Continuation-Passing Translation for Lexical Effect Handlers.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523710."},"https://doi.org/10.1145/3519939.3523430":{"mla":"Greenman, Ben. “Deep and Shallow Types for Gradual Languages.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523430."},"https://doi.org/10.1145/3519939.3523703":{"mla":"Patterson, Daniel, et al. “Semantic Soundness for Language Interoperability.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523703."},"https://doi.org/10.1145/3519939.3523433":{"mla":"Xu, Mingkuan, et al. “Quartz: Superoptimization of Quantum Circuits.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523433."},"https://doi.org/10.1145/3519939.3523431":{"mla":"Tao, Runzhou, et al. “Giallar: Push-Button Verification for the Qiskit Quantum Compiler.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523431."},"https://doi.org/10.1145/3519939.3523713":{"mla":"Peng, Yuxiang, et al. “Algebraic Reasoning of Quantum Programs via Non-Idempotent Kleene Algebra.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523713."},"https://doi.org/10.1145/3519939.3523438":{"mla":"Christensen, Michael, et al. “PyLSE: A Pulse-Transfer Level Language for Superconductor Electronics.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523438."},"https://doi.org/10.1145/3519939.3523439":{"mla":"Woodruff, Jackson, et al. “Bind the Gap: Compiling Real Software to Hardware FFT Accelerators.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523439."},"https://doi.org/10.1145/3519939.3523446":{"mla":"Ikarashi, Yuka, et al. “Exocompilation for Productive Programming of Hardware Accelerators.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523446."},"https://doi.org/10.1145/3519939.3523455":{"mla":"Zagieboylo, Drew, et al. “PDL: A High-Level Hardware Design Language for Pipelined Processors.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523455."},"https://doi.org/10.1145/3519939.3523454":{"mla":"Kortbeek, Vito, et al. “WARio: Efficient Code Generation for Intermittent Computing.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523454."},"https://doi.org/10.1145/3519939.3523456":{"mla":"Kong, Lingkun, et al. “Software-Hardware Codesign for Efficient in-Memory Regular Pattern Matching.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523456."},"https://doi.org/10.1145/3519939.3523451":{"mla":"Dang, Hoang-Hai, et al. “Compass: Strong and Compositional Library Specifications in Relaxed Memory Separation Logic.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523451."},"https://doi.org/10.1145/3519939.3523432":{"mla":"Mulder, Ike, et al. “Diaframe: Automated Verification of Fine-Grained Concurrent Programs in Iris.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523432."},"https://doi.org/10.1145/3519939.3523434":{"mla":"Sammler, Michael, et al. “Islaris: Verification of Machine Code against Authoritative ISA Semantics.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523434."},"https://doi.org/10.1145/3519939.3523436":{"mla":"Ahmadi, Ali, et al. “Efficient Approximations for Cache-Conscious Data Placement.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523436."},"https://doi.org/10.1145/3519939.3523448":{"mla":"Tang, Shizhi, et al. “FreeTensor: A Free-Form DSL with Holistic Optimizations for Irregular Tensor Programs.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523448."},"https://doi.org/10.1145/3519939.3523719":{"mla":"Rocha, Rodrigo C. O., et al. “Lasagne: A Static Binary Translator for Weak Memory Model Architectures.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523719."},"https://doi.org/10.1145/3519939.3523734":{"mla":"Zha, Junpeng, et al. “Verifying Optimizations of Concurrent Programs in the Promising Semantics.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523734."},"https://doi.org/10.1145/3519939.3523706":{"mla":"Pit-Claudel, Clément, et al. “Relational Compilation for Performance-Critical Applications: Extensible Proof-Producing Translation of Functional Models into Low-Level Code.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523706."},"https://doi.org/10.1145/3519939.3523702":{"mla":"Verbeek, Freek, et al. “Formally Verified Lifting of C-Compiled X86-64 Binaries.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523702."},"https://doi.org/10.1145/3519939.3523715":{"mla":"Doenges, Ryan, et al. “Leapfrog: Certified Equivalence for Protocol Parsers.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523715."},"https://doi.org/10.1145/3519939.3523707":{"mla":"Paraskevopoulou, Zoe, et al. “Computing Correctly with Inductive Relations.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523707."},"https://doi.org/10.1145/3519939.3523457":{"mla":"Polito, Guillermo, et al. “Interpreter-Guided Differential JIT Compiler Unit Testing.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523457."},"https://doi.org/10.1145/3519939.3523705":{"mla":"Parthasarathy, Suresh, et al. “Landmarks and Regions: A Robust Approach to Data Extraction.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523705."},"https://doi.org/10.1145/3519939.3523428":{"mla":"Wang, Mingzhe, et al. “Odin: On-Demand Instrumentation with on-the-Fly Recompilation.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523428."},"https://doi.org/10.1145/3519939.3523728":{"mla":"O’Connor, Liam, and Oskar Wickström. “Quickstrom: Property-Based Acceptance Testing with LTL Specifications.” Proceedings of the 43rd ACM SIGPLAN International Conference on Programming Language Design and Implementation, June 2022. Crossref, https://doi.org/10.1145/3519939.3523728."},"https://doi.org/10.1145/3563311":{"mla":"Titzer, Ben L. “A Fast In-Place Interpreter for WebAssembly.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 646–72. Crossref, https://doi.org/10.1145/3563311."},"https://doi.org/10.1145/3563323":{"mla":"Kirisame, Marisa, et al. “Optimal Heap Limits for Reducing Browser Memory Use.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 986–1006. Crossref, https://doi.org/10.1145/3563323."},"https://doi.org/10.1145/3563316":{"mla":"Chitre, Khushboo, et al. “The Road Not Taken: Exploring Alias Analysis Based Optimizations Missed by the Compiler.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 786–810. Crossref, https://doi.org/10.1145/3563316."},"https://doi.org/10.1145/3527312":{"mla":"Wang, Chengpeng, et al. “Complexity-Guided Container Replacement Synthesis.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–31. Crossref, https://doi.org/10.1145/3527312."},"https://doi.org/10.1145/3563336":{"mla":"Laddad, Shadaj, et al. “Katara: Synthesizing CRDTs with Verified Lifting.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1349–77. Crossref, https://doi.org/10.1145/3563336."},"https://doi.org/10.1145/3563310":{"mla":"Mishra, Ashish, and Suresh Jagannathan. “Specification-Guided Component-Based Synthesis from Effectful Libraries.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 616–45. Crossref, https://doi.org/10.1145/3563310."},"https://doi.org/10.1145/3527322":{"mla":"Machiry, Aravind, et al. “C to Checked C by 3c.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–29. Crossref, https://doi.org/10.1145/3527322."},"https://doi.org/10.1145/3563313":{"mla":"Abuah, Chiké, et al. “Solo: A Lightweight Static Analysis for Differential Privacy.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 699–728. Crossref, https://doi.org/10.1145/3563313."},"https://doi.org/10.1145/3563304":{"mla":"Parreaux, Lionel, and Chun Yin Chau. “MLstruct: Principal Type Inference in a Boolean Algebra of Structural Types.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 449–78. Crossref, https://doi.org/10.1145/3563304."},"https://doi.org/10.1145/3563318":{"mla":"Frumin, Dan, et al. “A Bunch of Sessions: A Propositions-as-Sessions Interpretation of Bunched Implications in Channel-Based Concurrency.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 841–69. Crossref, https://doi.org/10.1145/3563318."},"https://doi.org/10.1145/3563342":{"mla":"Boruch-Gruszecki, Aleksander, et al. “A Case for DOT: Theoretical Foundations for Objects with Pattern Matching and GADT-Style Reasoning.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1526–55. Crossref, https://doi.org/10.1145/3563342."},"https://doi.org/10.1145/3563319":{"mla":"Bianchini, Riccardo, et al. “Coeffects for Sharing and Mutation.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 870–98. Crossref, https://doi.org/10.1145/3563319."},"https://doi.org/10.1145/3563338":{"mla":"Chou, Stephen, and Saman Amarasinghe. “Compilation of Dynamic Sparse Tensor Algebra.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1408–37. Crossref, https://doi.org/10.1145/3563338."},"https://doi.org/10.1145/3563303":{"mla":"Zwaan, Aron, et al. “Incremental Type-Checking for Free: Using Scope Graphs to Derive Incremental Type-Checkers.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 424–48. Crossref, https://doi.org/10.1145/3563303."},"https://doi.org/10.1145/3563333":{"mla":"Sundararajah, Kirshanthan, et al. “UniRec: A Unimodular-like Framework for Nested Recursions and Loops.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1264–90. Crossref, https://doi.org/10.1145/3563333."},"https://doi.org/10.1145/3563340":{"mla":"Kolesar, John C., et al. “Checking Equivalence in a Non-Strict Language.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1469–96. Crossref, https://doi.org/10.1145/3563340."},"https://doi.org/10.1145/3563317":{"mla":"Mackay, Julian, et al. “Necessity\n            Specifications for Robustness.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 811–40. Crossref, https://doi.org/10.1145/3563317."},"https://doi.org/10.1145/3527331":{"mla":"Zhang, Linpeng, and Benjamin Lucien Kaminski. “Quantitative Strongest Post: A Calculus for Reasoning about the Flow of Quantitative Information.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–29. Crossref, https://doi.org/10.1145/3527331."},"https://doi.org/10.1145/3563328":{"mla":"Chaliasos, Stefanos, et al. “A Study of Inline Assembly in Solidity Smart Contracts.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1123–49. Crossref, https://doi.org/10.1145/3563328."},"https://doi.org/10.1145/3527321":{"mla":"Grech, Neville, et al. “Elipmoc: Advanced Decompilation of Ethereum Smart Contracts.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–27. Crossref, https://doi.org/10.1145/3527321."},"https://doi.org/10.1145/3563312":{"mla":"Zhao, Zihan, et al. “SigVM: Enabling Event-Driven Execution for Truly Decentralized Smart Contracts.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 673–98. Crossref, https://doi.org/10.1145/3563312."},"https://doi.org/10.1145/3563329":{"mla":"Jin, Charles, et al. “Neural Architecture Search Using Property Guided Synthesis.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1150–79. Crossref, https://doi.org/10.1145/3563329."},"https://doi.org/10.1145/3563348":{"mla":"Krogmeier, Paul, et al. “Synthesizing Axiomatizations Using Logic Learning.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1697–725. Crossref, https://doi.org/10.1145/3563348."},"https://doi.org/10.1145/3527311":{"mla":"Ferles, Kostas, et al. “Synthesizing Fine-Grained Synchronization Protocols for Implicit Monitors.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–26. Crossref, https://doi.org/10.1145/3527311."},"https://doi.org/10.1145/3527318":{"mla":"Georges, Aïna Linn, et al. “Le Temps Des Cerises: Efficient Temporal Stack Safety on Capability Machines Using Directed Capabilities.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–30. Crossref, https://doi.org/10.1145/3527318."},"https://doi.org/10.1145/3527314":{"mla":"Labrada, Elizabeth, et al. “Plausible Sealing for Gradual Parametricity.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–28. Crossref, https://doi.org/10.1145/3527314."},"https://doi.org/10.1145/3527326":{"mla":"Jacobs, Koen, et al. “Purity of an ST Monad: Full Abstraction by Semantically Typed Back-Translation.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–27. Crossref, https://doi.org/10.1145/3527326."},"https://doi.org/10.1145/3527325":{"mla":"Le, Quang Loc, et al. “Finding Real Bugs in Big Programs with Incorrectness Logic.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–27. Crossref, https://doi.org/10.1145/3527325."},"https://doi.org/10.1145/3563326":{"mla":"Dardinier, Thibault, et al. “Fractional Resources in Unbounded Separation Logic.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1066–92. Crossref, https://doi.org/10.1145/3563326."},"https://doi.org/10.1145/3563298":{"mla":"D’Osualdo, Emanuele, et al. “Proving Hypersafety Compositionally.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 289–314. Crossref, https://doi.org/10.1145/3563298."},"https://doi.org/10.1145/3527330":{"mla":"Paltenghi, Matteo, and Michael Pradel. “Bugs in Quantum Computing Platforms: An Empirical Study.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–27. Crossref, https://doi.org/10.1145/3527330."},"https://doi.org/10.1145/3563297":{"mla":"Yuan, Charles, and Michael Carbin. “Tower: Data Structures in Quantum Superposition.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 259–88. Crossref, https://doi.org/10.1145/3563297."},"https://doi.org/10.1145/3563309":{"mla":"Li, Liyi, et al. “Verified Compilation of Quantum Oracles.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 589–615. Crossref, https://doi.org/10.1145/3563309."},"https://doi.org/10.1145/3563288":{"mla":"Ritter, Fabian, and Sebastian Hack. “AnICA: Analyzing Inconsistencies in Microarchitectural Code Analyzers.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1–29. Crossref, https://doi.org/10.1145/3563288."},"https://doi.org/10.1145/3563330":{"mla":"Sakkas, Georgios, et al. “Seq2Parse: Neurosymbolic Parse Error Repair.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1180–206. Crossref, https://doi.org/10.1145/3563330."},"https://doi.org/10.1145/3563345":{"mla":"Zhu, Fengmin, et al. “BFF: Foundational and Automated Verification of Bitfield-Manipulating Programs.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1613–38. Crossref, https://doi.org/10.1145/3563345."},"https://doi.org/10.1145/3563290":{"mla":"Liu, Mengqi, et al. “Compositional Virtual Timelines: Verifying Dynamic-Priority Partitions with Algorithmic Temporal Isolation.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 60–88. Crossref, https://doi.org/10.1145/3563290."},"https://doi.org/10.1145/3527313":{"mla":"Li, Jialin, et al. “Linear Types for Large-Scale Systems Verification.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–28. Crossref, https://doi.org/10.1145/3527313."},"https://doi.org/10.1145/3527320":{"mla":"Brachthäuser, Jonathan Immanuel, et al. “Effects, Capabilities, and Boxes: From Scope-Based Reasoning to Type-Based Reasoning and Back.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–30. Crossref, https://doi.org/10.1145/3527320."},"https://doi.org/10.1145/3563289":{"mla":"Xie, Ningning, et al. “First-Class Names for Effect Handlers.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 30–59. Crossref, https://doi.org/10.1145/3563289."},"https://doi.org/10.1145/3563445":{"mla":"Ghica, Dan, et al. “High-Level Effect Handlers in C++.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1639–67. Crossref, https://doi.org/10.1145/3563445."},"https://doi.org/10.1145/3563347":{"mla":"Atkinson, Eric, et al. “Semi-Symbolic Inference for Efficient Streaming Probabilistic Programming.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1668–96. Crossref, https://doi.org/10.1145/3563347."},"https://doi.org/10.1145/3563344":{"mla":"Susag, Zachary, et al. “Symbolic Execution for Randomized Programs.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1583–612. Crossref, https://doi.org/10.1145/3563344."},"https://doi.org/10.1145/3563341":{"mla":"Moosbrugger, Marcel, et al. “This Is the Moment for Probabilistic Loops.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1497–525. Crossref, https://doi.org/10.1145/3563341."},"https://doi.org/10.1145/3563337":{"mla":"Meyer, Roland, et al. “A Concurrent Program Logic with a Future and History.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1378–407. Crossref, https://doi.org/10.1145/3563337."},"https://doi.org/10.1145/3563292":{"mla":"Haas, Thomas, et al. “CAAT: Consistency as a Theory.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 114–44. Crossref, https://doi.org/10.1145/3563292."},"https://doi.org/10.1145/3563352":{"mla":"Dalvandi, Sadegh, and Brijesh Dongol. “Implementing and Verifying Release-Acquire Transactional Memory in C11.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1817–44. Crossref, https://doi.org/10.1145/3563352."},"https://doi.org/10.1145/3563306":{"mla":"Sivaraman, Aishwarya, et al. “Data-Driven Lemma Synthesis for Interactive Proofs.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 505–31. Crossref, https://doi.org/10.1145/3563306."},"https://doi.org/10.1145/3563355":{"mla":"van der Rest, Cas, et al. “Intrinsically-Typed Definitional Interpreters à La Carte.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1903–32. Crossref, https://doi.org/10.1145/3563355."},"https://doi.org/10.1145/3527319":{"mla":"Ugare, Shubham, et al. “Proof Transfer for Fast Certification of Multiple Approximate Neural Networks.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–29. Crossref, https://doi.org/10.1145/3527319."},"https://doi.org/10.1145/3563296":{"mla":"Ritschel, Nico, et al. “Can Guided Decomposition Help End-Users Write Larger Block-Based Programs? A Mobile Robot Experiment.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 233–58. Crossref, https://doi.org/10.1145/3563296."},"https://doi.org/10.1145/3563294":{"mla":"Sun, Yaozhu, et al. “Compositional Embeddings of Domain-Specific Languages.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 175–203. Crossref, https://doi.org/10.1145/3563294."},"https://doi.org/10.1145/3527329":{"mla":"Pelsmaeker, Daniel A. A., et al. “Language-Parametric Static Semantic Code Completion.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–30. Crossref, https://doi.org/10.1145/3527329."},"https://doi.org/10.1145/3563302":{"mla":"Zhang, Yuhao, et al. “Overwatch: Learning Patterns in Code Edit Sequences.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 395–423. Crossref, https://doi.org/10.1145/3563302."},"https://doi.org/10.1145/3563332":{"mla":"Muduli, Sujit Kumar, and Subhajit Roy. “Satisfiability modulo Fuzzing: A Synergistic Combination of SMT Solving and Fuzzing.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1236–63. Crossref, https://doi.org/10.1145/3563332."},"https://doi.org/10.1145/3563350":{"mla":"Garg, Pranav, and Srinivasan H. Sengamedu. “Synthesizing Code Quality Rules from Examples.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1757–87. Crossref, https://doi.org/10.1145/3563350."},"https://doi.org/10.1145/3527324":{"mla":"Lesani, Mohsen, et al. “C4: Verified Transactional Objects.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–31. Crossref, https://doi.org/10.1145/3527324."},"https://doi.org/10.1145/3563300":{"mla":"Sela, Gal, and Erez Petrank. “Concurrent Size.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 345–72. Crossref, https://doi.org/10.1145/3563300."},"https://doi.org/10.1145/3563349":{"mla":"Chen, Adam, et al. “Veracity: Declarative Multicore Programming with Commutativity.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1726–56. Crossref, https://doi.org/10.1145/3563349."},"https://doi.org/10.1145/3527316":{"mla":"Yan, Peng, et al. “On Incorrectness Logic for Quantum Programs.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–28. Crossref, https://doi.org/10.1145/3527316."},"https://doi.org/10.1145/3527310":{"mla":"Batz, Kevin, et al. “Weighted Programming: A Programming Paradigm for Specifying Mathematical Models.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–30. Crossref, https://doi.org/10.1145/3527310."},"https://doi.org/10.1145/3563301":{"mla":"Bierhoff, Kevin. “Wildcards Need Witness Protection.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 373–94. Crossref, https://doi.org/10.1145/3563301."},"https://doi.org/10.1145/3527315":{"mla":"Mariano, Benjamin, et al. “Automated Transpilation of Imperative to Functional Code Using Neural-Guided Program Synthesis.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–27. Crossref, https://doi.org/10.1145/3527315."},"https://doi.org/10.1145/3563308":{"mla":"Chen, Yanju, et al. “Synthesis-Powered Optimization of Smart Contracts via Data Type Refactoring.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 560–88. Crossref, https://doi.org/10.1145/3563308."},"https://doi.org/10.1145/3563334":{"mla":"Kalita, Pankaj Kumar, et al. “Synthesizing Abstract Transformers.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1291–319. Crossref, https://doi.org/10.1145/3563334."},"https://doi.org/10.1145/3563339":{"mla":"Shi, Qingkai, et al. “Indexing the Extended Dyck-CFL Reachability for Context-Sensitive Program Analysis.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1438–68. Crossref, https://doi.org/10.1145/3563339."},"https://doi.org/10.1145/3563320":{"mla":"Dexter, Philip, et al. “The Essence of Online Data Processing.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 899–928. Crossref, https://doi.org/10.1145/3563320."},"https://doi.org/10.1145/3527328":{"mla":"Clément, Basile, and Albert Cohen. “End-to-End Translation Validation for the Halide Language.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–30. Crossref, https://doi.org/10.1145/3527328."},"https://doi.org/10.1145/3563305":{"mla":"Hoeflich, Joshua, et al. “Highly Illogical, Kirk: Spotting Type Mismatches in the Large despite Broken Contracts, Unsound Types, and Too Many Linters.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 479–504. Crossref, https://doi.org/10.1145/3563305."},"https://doi.org/10.1145/3563354":{"mla":"Murali, Adithya, et al. “Model-Guided Synthesis of Inductive Lemmas for FOL with Least Fixpoints.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1873–902. Crossref, https://doi.org/10.1145/3563354."},"https://doi.org/10.1145/3527333":{"mla":"Shaikhha, Amir, et al. “Functional Collection Programming with Semi-Ring Dictionaries.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–33. Crossref, https://doi.org/10.1145/3527333."},"https://doi.org/10.1145/3563324":{"mla":"Laurel, Jacob, et al. “A General Construction for Abstract Interpretation of Higher-Order Automatic Differentiation.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1007–35. Crossref, https://doi.org/10.1145/3563324."},"https://doi.org/10.1145/3563291":{"mla":"Goldstein, Harrison, and Benjamin C. Pierce. “Parsing Randomness.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 89–113. Crossref, https://doi.org/10.1145/3563291."},"https://doi.org/10.1145/3563299":{"mla":"Liu, Si, et al. “Bridging the Semantic Gap between Qualitative and Quantitative Models of Distributed Systems.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 315–44. Crossref, https://doi.org/10.1145/3563299."},"https://doi.org/10.1145/3527323":{"mla":"Dyer, Tristan, et al. “Applying Cognitive Principles to Model-Finding Output: The Positive Value of Negative Information.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA1, Apr. 2022, pp. 1–29. Crossref, https://doi.org/10.1145/3527323."},"https://doi.org/10.1145/3563325":{"mla":"Wu, Haoze, et al. “Scalable Verification of GNN-Based Job Schedulers.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1036–65. Crossref, https://doi.org/10.1145/3563325."},"https://doi.org/10.1145/3563314":{"mla":"Blaudeau, Clément, and Fengyun Liu. “A Conceptual Framework for Safe Object Initialization: A Principled and Mechanized Soundness Proof of the Celsius Model.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 729–57. Crossref, https://doi.org/10.1145/3563314."},"https://doi.org/10.1145/3563353":{"mla":"Chowdhary, Sangeeta, and Santosh Nagarakatte. “Fast Shadow Execution for Debugging Numerical Errors Using Error Free Transformations.” Proceedings of the ACM on Programming Languages, vol. 6, no. OOPSLA2, Oct. 2022, pp. 1845–72. Crossref, https://doi.org/10.1145/3563353."}}